espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_IN_INT_CLR_CH0_REG register
 *  Interrupt clear bits of channel 0
 */
#define AXI_DMA_IN_INT_CLR_CH0_REG (DR_REG_AXI_DMA_BASE + 0xc)
/** AXI_DMA_IN_DONE_CH0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH0_INT_CLR    (BIT(0))
#define AXI_DMA_IN_DONE_CH0_INT_CLR_M  (AXI_DMA_IN_DONE_CH0_INT_CLR_V << AXI_DMA_IN_DONE_CH0_INT_CLR_S)
#define AXI_DMA_IN_DONE_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DONE_CH0_INT_CLR_S  0
/** AXI_DMA_IN_SUC_EOF_CH0_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH0_INT_CLR    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH0_INT_CLR_M  (AXI_DMA_IN_SUC_EOF_CH0_INT_CLR_V << AXI_DMA_IN_SUC_EOF_CH0_INT_CLR_S)
#define AXI_DMA_IN_SUC_EOF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH0_INT_CLR_S  1
/** AXI_DMA_IN_ERR_EOF_CH0_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH0_INT_CLR    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH0_INT_CLR_M  (AXI_DMA_IN_ERR_EOF_CH0_INT_CLR_V << AXI_DMA_IN_ERR_EOF_CH0_INT_CLR_S)
#define AXI_DMA_IN_ERR_EOF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH0_INT_CLR_S  2
/** AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR_M  (AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR_V << AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR_S)
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_CLR_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_M  (AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_V << AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_CLR_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR_M  (AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR_V << AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR_S)
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_CLR_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR_M  (AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR_V << AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR_S)
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_CLR_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR_M  (AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR_V << AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR_S)
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_CLR_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR_M  (AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR_V << AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR_S)
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_CLR_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR_M  (AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR_V << AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR_S)
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_CLR_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR_M  (AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR_V << AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR_S)
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_CLR_S  10

/** AXI_DMA_IN_CONF0_CH0_REG register
 *  Configure 0 register of Rx channel 0
 */
#define AXI_DMA_IN_CONF0_CH0_REG (DR_REG_AXI_DMA_BASE + 0x10)
/** AXI_DMA_IN_RST_CH0 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to reset AXI_DMA channel 0 Rx FSM and Rx FIFO pointer.
 */
#define AXI_DMA_IN_RST_CH0    (BIT(0))
#define AXI_DMA_IN_RST_CH0_M  (AXI_DMA_IN_RST_CH0_V << AXI_DMA_IN_RST_CH0_S)
#define AXI_DMA_IN_RST_CH0_V  0x00000001U
#define AXI_DMA_IN_RST_CH0_S  0
/** AXI_DMA_IN_LOOP_TEST_CH0 : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_LOOP_TEST_CH0    (BIT(1))
#define AXI_DMA_IN_LOOP_TEST_CH0_M  (AXI_DMA_IN_LOOP_TEST_CH0_V << AXI_DMA_IN_LOOP_TEST_CH0_S)
#define AXI_DMA_IN_LOOP_TEST_CH0_V  0x00000001U
#define AXI_DMA_IN_LOOP_TEST_CH0_S  1
/** AXI_DMA_MEM_TRANS_EN_CH0 : R/W; bitpos: [2]; default: 0;
 *  Set this bit 1 to enable automatic transmitting data from memory to memory via
 *  AXI_DMA.
 */
#define AXI_DMA_MEM_TRANS_EN_CH0    (BIT(2))
#define AXI_DMA_MEM_TRANS_EN_CH0_M  (AXI_DMA_MEM_TRANS_EN_CH0_V << AXI_DMA_MEM_TRANS_EN_CH0_S)
#define AXI_DMA_MEM_TRANS_EN_CH0_V  0x00000001U
#define AXI_DMA_MEM_TRANS_EN_CH0_S  2
/** AXI_DMA_IN_ETM_EN_CH0 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to 1 to enable etm control mode, dma Rx channel 0 is triggered by etm
 *  task.
 */
#define AXI_DMA_IN_ETM_EN_CH0    (BIT(3))
#define AXI_DMA_IN_ETM_EN_CH0_M  (AXI_DMA_IN_ETM_EN_CH0_V << AXI_DMA_IN_ETM_EN_CH0_S)
#define AXI_DMA_IN_ETM_EN_CH0_V  0x00000001U
#define AXI_DMA_IN_ETM_EN_CH0_S  3
/** AXI_DMA_IN_BURST_SIZE_SEL_CH0 : R/W; bitpos: [6:4]; default: 0;
 *  3'b000-3'b100:burst length 8byte~128byte
 */
#define AXI_DMA_IN_BURST_SIZE_SEL_CH0    0x00000007U
#define AXI_DMA_IN_BURST_SIZE_SEL_CH0_M  (AXI_DMA_IN_BURST_SIZE_SEL_CH0_V << AXI_DMA_IN_BURST_SIZE_SEL_CH0_S)
#define AXI_DMA_IN_BURST_SIZE_SEL_CH0_V  0x00000007U
#define AXI_DMA_IN_BURST_SIZE_SEL_CH0_S  4
/** AXI_DMA_IN_CMD_DISABLE_CH0 : R/W; bitpos: [7]; default: 0;
 *  1:mean disable cmd of this ch0
 */
#define AXI_DMA_IN_CMD_DISABLE_CH0    (BIT(7))
#define AXI_DMA_IN_CMD_DISABLE_CH0_M  (AXI_DMA_IN_CMD_DISABLE_CH0_V << AXI_DMA_IN_CMD_DISABLE_CH0_S)
#define AXI_DMA_IN_CMD_DISABLE_CH0_V  0x00000001U
#define AXI_DMA_IN_CMD_DISABLE_CH0_S  7
/** AXI_DMA_IN_ECC_AEC_EN_CH0 : R/W; bitpos: [8]; default: 0;
 *  1: mean access ecc or aes domain,0: mean not
 */
#define AXI_DMA_IN_ECC_AEC_EN_CH0    (BIT(8))
#define AXI_DMA_IN_ECC_AEC_EN_CH0_M  (AXI_DMA_IN_ECC_AEC_EN_CH0_V << AXI_DMA_IN_ECC_AEC_EN_CH0_S)
#define AXI_DMA_IN_ECC_AEC_EN_CH0_V  0x00000001U
#define AXI_DMA_IN_ECC_AEC_EN_CH0_S  8
/** AXI_DMA_INDSCR_BURST_EN_CH0 : R/W; bitpos: [9]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link
 *  descriptor when accessing internal SRAM.
 */
#define AXI_DMA_INDSCR_BURST_EN_CH0    (BIT(9))
#define AXI_DMA_INDSCR_BURST_EN_CH0_M  (AXI_DMA_INDSCR_BURST_EN_CH0_V << AXI_DMA_INDSCR_BURST_EN_CH0_S)
#define AXI_DMA_INDSCR_BURST_EN_CH0_V  0x00000001U
#define AXI_DMA_INDSCR_BURST_EN_CH0_S  9

/** AXI_DMA_IN_CONF1_CH0_REG register
 *  Configure 1 register of Rx channel 0
 */
#define AXI_DMA_IN_CONF1_CH0_REG (DR_REG_AXI_DMA_BASE + 0x14)
/** AXI_DMA_IN_CHECK_OWNER_CH0 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define AXI_DMA_IN_CHECK_OWNER_CH0    (BIT(12))
#define AXI_DMA_IN_CHECK_OWNER_CH0_M  (AXI_DMA_IN_CHECK_OWNER_CH0_V << AXI_DMA_IN_CHECK_OWNER_CH0_S)
#define AXI_DMA_IN_CHECK_OWNER_CH0_V  0x00000001U
#define AXI_DMA_IN_CHECK_OWNER_CH0_S  12

/** AXI_DMA_INFIFO_STATUS_CH0_REG register
 *  Receive FIFO status of Rx channel 0
 */
#define AXI_DMA_INFIFO_STATUS_CH0_REG (DR_REG_AXI_DMA_BASE + 0x18)
/** AXI_DMA_INFIFO_L3_FULL_CH0 : RO; bitpos: [0]; default: 1;
 *  L3 Rx FIFO full signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_FULL_CH0    (BIT(0))
#define AXI_DMA_INFIFO_L3_FULL_CH0_M  (AXI_DMA_INFIFO_L3_FULL_CH0_V << AXI_DMA_INFIFO_L3_FULL_CH0_S)
#define AXI_DMA_INFIFO_L3_FULL_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L3_FULL_CH0_S  0
/** AXI_DMA_INFIFO_L3_EMPTY_CH0 : RO; bitpos: [1]; default: 1;
 *  L3 Rx FIFO empty signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_EMPTY_CH0    (BIT(1))
#define AXI_DMA_INFIFO_L3_EMPTY_CH0_M  (AXI_DMA_INFIFO_L3_EMPTY_CH0_V << AXI_DMA_INFIFO_L3_EMPTY_CH0_S)
#define AXI_DMA_INFIFO_L3_EMPTY_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L3_EMPTY_CH0_S  1
/** AXI_DMA_INFIFO_L3_CNT_CH0 : RO; bitpos: [7:2]; default: 0;
 *  The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_CNT_CH0    0x0000003FU
#define AXI_DMA_INFIFO_L3_CNT_CH0_M  (AXI_DMA_INFIFO_L3_CNT_CH0_V << AXI_DMA_INFIFO_L3_CNT_CH0_S)
#define AXI_DMA_INFIFO_L3_CNT_CH0_V  0x0000003FU
#define AXI_DMA_INFIFO_L3_CNT_CH0_S  2
/** AXI_DMA_INFIFO_L3_UDF_CH0 : RO; bitpos: [8]; default: 0;
 *  L3 Rx FIFO under flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH0    (BIT(8))
#define AXI_DMA_INFIFO_L3_UDF_CH0_M  (AXI_DMA_INFIFO_L3_UDF_CH0_V << AXI_DMA_INFIFO_L3_UDF_CH0_S)
#define AXI_DMA_INFIFO_L3_UDF_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH0_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH0 : RO; bitpos: [9]; default: 0;
 *  L3 Rx FIFO over flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH0    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH0_M  (AXI_DMA_INFIFO_L3_OVF_CH0_V << AXI_DMA_INFIFO_L3_OVF_CH0_S)
#define AXI_DMA_INFIFO_L3_OVF_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH0_S  9
/** AXI_DMA_INFIFO_L1_FULL_CH0 : RO; bitpos: [10]; default: 0;
 *  L1 Rx FIFO full signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_FULL_CH0    (BIT(10))
#define AXI_DMA_INFIFO_L1_FULL_CH0_M  (AXI_DMA_INFIFO_L1_FULL_CH0_V << AXI_DMA_INFIFO_L1_FULL_CH0_S)
#define AXI_DMA_INFIFO_L1_FULL_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L1_FULL_CH0_S  10
/** AXI_DMA_INFIFO_L1_EMPTY_CH0 : RO; bitpos: [11]; default: 1;
 *  L1 Rx FIFO empty signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_EMPTY_CH0    (BIT(11))
#define AXI_DMA_INFIFO_L1_EMPTY_CH0_M  (AXI_DMA_INFIFO_L1_EMPTY_CH0_V << AXI_DMA_INFIFO_L1_EMPTY_CH0_S)
#define AXI_DMA_INFIFO_L1_EMPTY_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L1_EMPTY_CH0_S  11
/** AXI_DMA_INFIFO_L1_UDF_CH0 : RO; bitpos: [12]; default: 0;
 *  L1 Rx FIFO under flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH0    (BIT(12))
#define AXI_DMA_INFIFO_L1_UDF_CH0_M  (AXI_DMA_INFIFO_L1_UDF_CH0_V << AXI_DMA_INFIFO_L1_UDF_CH0_S)
#define AXI_DMA_INFIFO_L1_UDF_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH0_S  12
/** AXI_DMA_INFIFO_L1_OVF_CH0 : RO; bitpos: [13]; default: 0;
 *  L1 Rx FIFO over flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH0    (BIT(13))
#define AXI_DMA_INFIFO_L1_OVF_CH0_M  (AXI_DMA_INFIFO_L1_OVF_CH0_V << AXI_DMA_INFIFO_L1_OVF_CH0_S)
#define AXI_DMA_INFIFO_L1_OVF_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH0_S  13
/** AXI_DMA_INFIFO_L2_FULL_CH0 : RO; bitpos: [14]; default: 0;
 *  L2 Rx RAM full signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_FULL_CH0    (BIT(14))
#define AXI_DMA_INFIFO_L2_FULL_CH0_M  (AXI_DMA_INFIFO_L2_FULL_CH0_V << AXI_DMA_INFIFO_L2_FULL_CH0_S)
#define AXI_DMA_INFIFO_L2_FULL_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L2_FULL_CH0_S  14
/** AXI_DMA_INFIFO_L2_EMPTY_CH0 : RO; bitpos: [15]; default: 1;
 *  L2 Rx RAM empty signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_EMPTY_CH0    (BIT(15))
#define AXI_DMA_INFIFO_L2_EMPTY_CH0_M  (AXI_DMA_INFIFO_L2_EMPTY_CH0_V << AXI_DMA_INFIFO_L2_EMPTY_CH0_S)
#define AXI_DMA_INFIFO_L2_EMPTY_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L2_EMPTY_CH0_S  15
/** AXI_DMA_INFIFO_L2_UDF_CH0 : RO; bitpos: [16]; default: 0;
 *  L2 Rx FIFO under flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH0    (BIT(16))
#define AXI_DMA_INFIFO_L2_UDF_CH0_M  (AXI_DMA_INFIFO_L2_UDF_CH0_V << AXI_DMA_INFIFO_L2_UDF_CH0_S)
#define AXI_DMA_INFIFO_L2_UDF_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH0_S  16
/** AXI_DMA_INFIFO_L2_OVF_CH0 : RO; bitpos: [17]; default: 0;
 *  L2 Rx FIFO over flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH0    (BIT(17))
#define AXI_DMA_INFIFO_L2_OVF_CH0_M  (AXI_DMA_INFIFO_L2_OVF_CH0_V << AXI_DMA_INFIFO_L2_OVF_CH0_S)
#define AXI_DMA_INFIFO_L2_OVF_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH0_S  17
/** AXI_DMA_IN_REMAIN_UNDER_1B_CH0 : RO; bitpos: [23]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH0    (BIT(23))
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_1B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_1B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH0_S  23
/** AXI_DMA_IN_REMAIN_UNDER_2B_CH0 : RO; bitpos: [24]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH0    (BIT(24))
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_2B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_2B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH0_S  24
/** AXI_DMA_IN_REMAIN_UNDER_3B_CH0 : RO; bitpos: [25]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH0    (BIT(25))
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_3B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_3B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH0_S  25
/** AXI_DMA_IN_REMAIN_UNDER_4B_CH0 : RO; bitpos: [26]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH0    (BIT(26))
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_4B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_4B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH0_S  26
/** AXI_DMA_IN_REMAIN_UNDER_5B_CH0 : RO; bitpos: [27]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH0    (BIT(27))
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_5B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_5B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH0_S  27
/** AXI_DMA_IN_REMAIN_UNDER_6B_CH0 : RO; bitpos: [28]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH0    (BIT(28))
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_6B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_6B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH0_S  28
/** AXI_DMA_IN_REMAIN_UNDER_7B_CH0 : RO; bitpos: [29]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH0    (BIT(29))
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_7B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_7B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH0_S  29
/** AXI_DMA_IN_REMAIN_UNDER_8B_CH0 : RO; bitpos: [30]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH0    (BIT(30))
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH0_M  (AXI_DMA_IN_REMAIN_UNDER_8B_CH0_V << AXI_DMA_IN_REMAIN_UNDER_8B_CH0_S)
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH0_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH0_S  30
/** AXI_DMA_IN_BUF_HUNGRY_CH0 : RO; bitpos: [31]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_BUF_HUNGRY_CH0    (BIT(31))
#define AXI_DMA_IN_BUF_HUNGRY_CH0_M  (AXI_DMA_IN_BUF_HUNGRY_CH0_V << AXI_DMA_IN_BUF_HUNGRY_CH0_S)
#define AXI_DMA_IN_BUF_HUNGRY_CH0_V  0x00000001U
#define AXI_DMA_IN_BUF_HUNGRY_CH0_S  31

/** AXI_DMA_IN_POP_CH0_REG register
 *  Pop control register of Rx channel 0
 */
#define AXI_DMA_IN_POP_CH0_REG (DR_REG_AXI_DMA_BASE + 0x1c)
/** AXI_DMA_INFIFO_RDATA_CH0 : RO; bitpos: [11:0]; default: 2048;
 *  This register stores the data popping from AXI_DMA FIFO.
 */
#define AXI_DMA_INFIFO_RDATA_CH0    0x00000FFFU
#define AXI_DMA_INFIFO_RDATA_CH0_M  (AXI_DMA_INFIFO_RDATA_CH0_V << AXI_DMA_INFIFO_RDATA_CH0_S)
#define AXI_DMA_INFIFO_RDATA_CH0_V  0x00000FFFU
#define AXI_DMA_INFIFO_RDATA_CH0_S  0
/** AXI_DMA_INFIFO_POP_CH0 : WT; bitpos: [12]; default: 0;
 *  Set this bit to pop data from AXI_DMA FIFO.
 */
#define AXI_DMA_INFIFO_POP_CH0    (BIT(12))
#define AXI_DMA_INFIFO_POP_CH0_M  (AXI_DMA_INFIFO_POP_CH0_V << AXI_DMA_INFIFO_POP_CH0_S)
#define AXI_DMA_INFIFO_POP_CH0_V  0x00000001U
#define AXI_DMA_INFIFO_POP_CH0_S  12

/** AXI_DMA_IN_LINK1_CH0_REG register
 *  Link descriptor configure and control register of Rx channel 0
 */
#define AXI_DMA_IN_LINK1_CH0_REG (DR_REG_AXI_DMA_BASE + 0x20)
/** AXI_DMA_INLINK_AUTO_RET_CH0 : R/W; bitpos: [0]; default: 1;
 *  Set this bit to return to current inlink descriptor's address when there are some
 *  errors in current receiving data.
 */
#define AXI_DMA_INLINK_AUTO_RET_CH0    (BIT(0))
#define AXI_DMA_INLINK_AUTO_RET_CH0_M  (AXI_DMA_INLINK_AUTO_RET_CH0_V << AXI_DMA_INLINK_AUTO_RET_CH0_S)
#define AXI_DMA_INLINK_AUTO_RET_CH0_V  0x00000001U
#define AXI_DMA_INLINK_AUTO_RET_CH0_S  0
/** AXI_DMA_INLINK_STOP_CH0 : WT; bitpos: [1]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define AXI_DMA_INLINK_STOP_CH0    (BIT(1))
#define AXI_DMA_INLINK_STOP_CH0_M  (AXI_DMA_INLINK_STOP_CH0_V << AXI_DMA_INLINK_STOP_CH0_S)
#define AXI_DMA_INLINK_STOP_CH0_V  0x00000001U
#define AXI_DMA_INLINK_STOP_CH0_S  1
/** AXI_DMA_INLINK_START_CH0 : WT; bitpos: [2]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define AXI_DMA_INLINK_START_CH0    (BIT(2))
#define AXI_DMA_INLINK_START_CH0_M  (AXI_DMA_INLINK_START_CH0_V << AXI_DMA_INLINK_START_CH0_S)
#define AXI_DMA_INLINK_START_CH0_V  0x00000001U
#define AXI_DMA_INLINK_START_CH0_S  2
/** AXI_DMA_INLINK_RESTART_CH0 : WT; bitpos: [3]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define AXI_DMA_INLINK_RESTART_CH0    (BIT(3))
#define AXI_DMA_INLINK_RESTART_CH0_M  (AXI_DMA_INLINK_RESTART_CH0_V << AXI_DMA_INLINK_RESTART_CH0_S)
#define AXI_DMA_INLINK_RESTART_CH0_V  0x00000001U
#define AXI_DMA_INLINK_RESTART_CH0_S  3
/** AXI_DMA_INLINK_PARK_CH0 : RO; bitpos: [4]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define AXI_DMA_INLINK_PARK_CH0    (BIT(4))
#define AXI_DMA_INLINK_PARK_CH0_M  (AXI_DMA_INLINK_PARK_CH0_V << AXI_DMA_INLINK_PARK_CH0_S)
#define AXI_DMA_INLINK_PARK_CH0_V  0x00000001U
#define AXI_DMA_INLINK_PARK_CH0_S  4

