espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_IN_INT_ENA_CH1_REG register
 *  Interrupt enable bits of channel 1
 */
#define AXI_DMA_IN_INT_ENA_CH1_REG (DR_REG_AXI_DMA_BASE + 0x70)
/** AXI_DMA_IN_DONE_CH1_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH1_INT_ENA    (BIT(0))
#define AXI_DMA_IN_DONE_CH1_INT_ENA_M  (AXI_DMA_IN_DONE_CH1_INT_ENA_V << AXI_DMA_IN_DONE_CH1_INT_ENA_S)
#define AXI_DMA_IN_DONE_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DONE_CH1_INT_ENA_S  0
/** AXI_DMA_IN_SUC_EOF_CH1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH1_INT_ENA    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH1_INT_ENA_M  (AXI_DMA_IN_SUC_EOF_CH1_INT_ENA_V << AXI_DMA_IN_SUC_EOF_CH1_INT_ENA_S)
#define AXI_DMA_IN_SUC_EOF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH1_INT_ENA_S  1
/** AXI_DMA_IN_ERR_EOF_CH1_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH1_INT_ENA    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH1_INT_ENA_M  (AXI_DMA_IN_ERR_EOF_CH1_INT_ENA_V << AXI_DMA_IN_ERR_EOF_CH1_INT_ENA_S)
#define AXI_DMA_IN_ERR_EOF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH1_INT_ENA_S  2
/** AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA_M  (AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA_V << AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA_S)
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_ENA_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA_M  (AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA_V << AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_ENA_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA_M  (AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA_V << AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA_S)
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_ENA_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA_M  (AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA_V << AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA_S)
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_ENA_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA_M  (AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA_V << AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA_S)
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_ENA_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA_M  (AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA_V << AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA_S)
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_ENA_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA_M  (AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA_V << AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA_S)
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_ENA_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA_M  (AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA_V << AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA_S)
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_ENA_S  10

/** AXI_DMA_IN_INT_CLR_CH1_REG register
 *  Interrupt clear bits of channel 1
 */
#define AXI_DMA_IN_INT_CLR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x74)
/** AXI_DMA_IN_DONE_CH1_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH1_INT_CLR    (BIT(0))
#define AXI_DMA_IN_DONE_CH1_INT_CLR_M  (AXI_DMA_IN_DONE_CH1_INT_CLR_V << AXI_DMA_IN_DONE_CH1_INT_CLR_S)
#define AXI_DMA_IN_DONE_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DONE_CH1_INT_CLR_S  0
/** AXI_DMA_IN_SUC_EOF_CH1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH1_INT_CLR    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH1_INT_CLR_M  (AXI_DMA_IN_SUC_EOF_CH1_INT_CLR_V << AXI_DMA_IN_SUC_EOF_CH1_INT_CLR_S)
#define AXI_DMA_IN_SUC_EOF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH1_INT_CLR_S  1
/** AXI_DMA_IN_ERR_EOF_CH1_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH1_INT_CLR    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH1_INT_CLR_M  (AXI_DMA_IN_ERR_EOF_CH1_INT_CLR_V << AXI_DMA_IN_ERR_EOF_CH1_INT_CLR_S)
#define AXI_DMA_IN_ERR_EOF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH1_INT_CLR_S  2
/** AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR_M  (AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR_V << AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR_S)
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH1_INT_CLR_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR_M  (AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR_V << AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH1_INT_CLR_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR_M  (AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR_V << AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR_S)
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH1_INT_CLR_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR_M  (AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR_V << AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR_S)
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH1_INT_CLR_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR_M  (AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR_V << AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR_S)
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH1_INT_CLR_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR_M  (AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR_V << AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR_S)
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH1_INT_CLR_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR_M  (AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR_V << AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR_S)
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH1_INT_CLR_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR_M  (AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR_V << AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR_S)
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH1_INT_CLR_S  10

