espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_RX_CRC_EN_ADDR_CH1_REG register
 *  This register is used to config ch1 crc en addr
 */
#define AXI_DMA_RX_CRC_EN_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0xc4)
/** AXI_DMA_RX_CRC_EN_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_RX_CRC_EN_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_RX_CRC_EN_ADDR_CH1_M  (AXI_DMA_RX_CRC_EN_ADDR_CH1_V << AXI_DMA_RX_CRC_EN_ADDR_CH1_S)
#define AXI_DMA_RX_CRC_EN_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_RX_CRC_EN_ADDR_CH1_S  0

/** AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_REG register
 *  This register is used to config crc data_8bit en
 */
#define AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_REG (DR_REG_AXI_DMA_BASE + 0xc8)
/** AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1 : R/W; bitpos: [15:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1    0x0000FFFFU
#define AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_M  (AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_V << AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_S)
#define AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_V  0x0000FFFFU
#define AXI_DMA_RX_CRC_DATA_EN_WR_DATA_CH1_S  0

/** AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_REG register
 *  This register is used to config addr of crc data_8bit en
 */
#define AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0xcc)
/** AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_M  (AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_V << AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_S)
#define AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_RX_CRC_DATA_EN_ADDR_CH1_S  0

/** AXI_DMA_IN_INT_RAW_CH2_REG register
 *  Raw status interrupt of channel 2
 */
#define AXI_DMA_IN_INT_RAW_CH2_REG (DR_REG_AXI_DMA_BASE + 0xd0)
/** AXI_DMA_IN_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received for Rx channel 0.
 */
#define AXI_DMA_IN_DONE_CH2_INT_RAW    (BIT(0))
#define AXI_DMA_IN_DONE_CH2_INT_RAW_M  (AXI_DMA_IN_DONE_CH2_INT_RAW_V << AXI_DMA_IN_DONE_CH2_INT_RAW_S)
#define AXI_DMA_IN_DONE_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DONE_CH2_INT_RAW_S  0
/** AXI_DMA_IN_SUC_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received for Rx channel 0. For UHCI0 the raw interrupt bit
 *  turns to high level when the last data pointed by one inlink descriptor has been
 *  received and no data error is detected for Rx channel 0.
 */
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_M  (AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_V << AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_S)
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_S  1
/** AXI_DMA_IN_ERR_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when data error is detected only in the
 *  case that the peripheral is UHCI0 for Rx channel 0. For other peripherals this raw
 *  interrupt is reserved.
 */
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_M  (AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_V << AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_S)
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_S  2
/** AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error
 *  including owner error and the second and third word error of inlink descriptor for
 *  Rx channel 0.
 */
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_M  (AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_V << AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_S)
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full
 *  and receiving data is not completed but there is no more inlink for Rx channel 0.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_M  (AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V << AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_S  10

