espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_INFIFO_STATUS_CH2_REG register
 *  Receive FIFO status of Rx channel 2
 */
#define AXI_DMA_INFIFO_STATUS_CH2_REG (DR_REG_AXI_DMA_BASE + 0xe8)
/** AXI_DMA_INFIFO_L3_FULL_CH2 : RO; bitpos: [0]; default: 1;
 *  L3 Rx FIFO full signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_FULL_CH2    (BIT(0))
#define AXI_DMA_INFIFO_L3_FULL_CH2_M  (AXI_DMA_INFIFO_L3_FULL_CH2_V << AXI_DMA_INFIFO_L3_FULL_CH2_S)
#define AXI_DMA_INFIFO_L3_FULL_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L3_FULL_CH2_S  0
/** AXI_DMA_INFIFO_L3_EMPTY_CH2 : RO; bitpos: [1]; default: 1;
 *  L3 Rx FIFO empty signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_EMPTY_CH2    (BIT(1))
#define AXI_DMA_INFIFO_L3_EMPTY_CH2_M  (AXI_DMA_INFIFO_L3_EMPTY_CH2_V << AXI_DMA_INFIFO_L3_EMPTY_CH2_S)
#define AXI_DMA_INFIFO_L3_EMPTY_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L3_EMPTY_CH2_S  1
/** AXI_DMA_INFIFO_L3_CNT_CH2 : RO; bitpos: [7:2]; default: 0;
 *  The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_CNT_CH2    0x0000003FU
#define AXI_DMA_INFIFO_L3_CNT_CH2_M  (AXI_DMA_INFIFO_L3_CNT_CH2_V << AXI_DMA_INFIFO_L3_CNT_CH2_S)
#define AXI_DMA_INFIFO_L3_CNT_CH2_V  0x0000003FU
#define AXI_DMA_INFIFO_L3_CNT_CH2_S  2
/** AXI_DMA_INFIFO_L3_UDF_CH2 : RO; bitpos: [8]; default: 0;
 *  L3 Rx FIFO under flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH2    (BIT(8))
#define AXI_DMA_INFIFO_L3_UDF_CH2_M  (AXI_DMA_INFIFO_L3_UDF_CH2_V << AXI_DMA_INFIFO_L3_UDF_CH2_S)
#define AXI_DMA_INFIFO_L3_UDF_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH2_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH2 : RO; bitpos: [9]; default: 0;
 *  L3 Rx FIFO over flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH2    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH2_M  (AXI_DMA_INFIFO_L3_OVF_CH2_V << AXI_DMA_INFIFO_L3_OVF_CH2_S)
#define AXI_DMA_INFIFO_L3_OVF_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH2_S  9
/** AXI_DMA_INFIFO_L1_FULL_CH2 : RO; bitpos: [10]; default: 0;
 *  L1 Rx FIFO full signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_FULL_CH2    (BIT(10))
#define AXI_DMA_INFIFO_L1_FULL_CH2_M  (AXI_DMA_INFIFO_L1_FULL_CH2_V << AXI_DMA_INFIFO_L1_FULL_CH2_S)
#define AXI_DMA_INFIFO_L1_FULL_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L1_FULL_CH2_S  10
/** AXI_DMA_INFIFO_L1_EMPTY_CH2 : RO; bitpos: [11]; default: 1;
 *  L1 Rx FIFO empty signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_EMPTY_CH2    (BIT(11))
#define AXI_DMA_INFIFO_L1_EMPTY_CH2_M  (AXI_DMA_INFIFO_L1_EMPTY_CH2_V << AXI_DMA_INFIFO_L1_EMPTY_CH2_S)
#define AXI_DMA_INFIFO_L1_EMPTY_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L1_EMPTY_CH2_S  11
/** AXI_DMA_INFIFO_L1_UDF_CH2 : RO; bitpos: [12]; default: 0;
 *  L1 Rx FIFO under flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH2    (BIT(12))
#define AXI_DMA_INFIFO_L1_UDF_CH2_M  (AXI_DMA_INFIFO_L1_UDF_CH2_V << AXI_DMA_INFIFO_L1_UDF_CH2_S)
#define AXI_DMA_INFIFO_L1_UDF_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH2_S  12
/** AXI_DMA_INFIFO_L1_OVF_CH2 : RO; bitpos: [13]; default: 0;
 *  L1 Rx FIFO over flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH2    (BIT(13))
#define AXI_DMA_INFIFO_L1_OVF_CH2_M  (AXI_DMA_INFIFO_L1_OVF_CH2_V << AXI_DMA_INFIFO_L1_OVF_CH2_S)
#define AXI_DMA_INFIFO_L1_OVF_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH2_S  13
/** AXI_DMA_INFIFO_L2_FULL_CH2 : RO; bitpos: [14]; default: 0;
 *  L2 Rx RAM full signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_FULL_CH2    (BIT(14))
#define AXI_DMA_INFIFO_L2_FULL_CH2_M  (AXI_DMA_INFIFO_L2_FULL_CH2_V << AXI_DMA_INFIFO_L2_FULL_CH2_S)
#define AXI_DMA_INFIFO_L2_FULL_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L2_FULL_CH2_S  14
/** AXI_DMA_INFIFO_L2_EMPTY_CH2 : RO; bitpos: [15]; default: 1;
 *  L2 Rx RAM empty signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_EMPTY_CH2    (BIT(15))
#define AXI_DMA_INFIFO_L2_EMPTY_CH2_M  (AXI_DMA_INFIFO_L2_EMPTY_CH2_V << AXI_DMA_INFIFO_L2_EMPTY_CH2_S)
#define AXI_DMA_INFIFO_L2_EMPTY_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L2_EMPTY_CH2_S  15
/** AXI_DMA_INFIFO_L2_UDF_CH2 : RO; bitpos: [16]; default: 0;
 *  L2 Rx FIFO under flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH2    (BIT(16))
#define AXI_DMA_INFIFO_L2_UDF_CH2_M  (AXI_DMA_INFIFO_L2_UDF_CH2_V << AXI_DMA_INFIFO_L2_UDF_CH2_S)
#define AXI_DMA_INFIFO_L2_UDF_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH2_S  16
/** AXI_DMA_INFIFO_L2_OVF_CH2 : RO; bitpos: [17]; default: 0;
 *  L2 Rx FIFO over flow signal for Rx channel 0.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH2    (BIT(17))
#define AXI_DMA_INFIFO_L2_OVF_CH2_M  (AXI_DMA_INFIFO_L2_OVF_CH2_V << AXI_DMA_INFIFO_L2_OVF_CH2_S)
#define AXI_DMA_INFIFO_L2_OVF_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH2_S  17
/** AXI_DMA_IN_REMAIN_UNDER_1B_CH2 : RO; bitpos: [23]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH2    (BIT(23))
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_1B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_1B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_1B_CH2_S  23
/** AXI_DMA_IN_REMAIN_UNDER_2B_CH2 : RO; bitpos: [24]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH2    (BIT(24))
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_2B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_2B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_2B_CH2_S  24
/** AXI_DMA_IN_REMAIN_UNDER_3B_CH2 : RO; bitpos: [25]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH2    (BIT(25))
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_3B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_3B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_3B_CH2_S  25
/** AXI_DMA_IN_REMAIN_UNDER_4B_CH2 : RO; bitpos: [26]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH2    (BIT(26))
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_4B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_4B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_4B_CH2_S  26
/** AXI_DMA_IN_REMAIN_UNDER_5B_CH2 : RO; bitpos: [27]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH2    (BIT(27))
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_5B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_5B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_5B_CH2_S  27
/** AXI_DMA_IN_REMAIN_UNDER_6B_CH2 : RO; bitpos: [28]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH2    (BIT(28))
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_6B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_6B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_6B_CH2_S  28
/** AXI_DMA_IN_REMAIN_UNDER_7B_CH2 : RO; bitpos: [29]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH2    (BIT(29))
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_7B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_7B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_7B_CH2_S  29
/** AXI_DMA_IN_REMAIN_UNDER_8B_CH2 : RO; bitpos: [30]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH2    (BIT(30))
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH2_M  (AXI_DMA_IN_REMAIN_UNDER_8B_CH2_V << AXI_DMA_IN_REMAIN_UNDER_8B_CH2_S)
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH2_V  0x00000001U
#define AXI_DMA_IN_REMAIN_UNDER_8B_CH2_S  30
/** AXI_DMA_IN_BUF_HUNGRY_CH2 : RO; bitpos: [31]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_BUF_HUNGRY_CH2    (BIT(31))
#define AXI_DMA_IN_BUF_HUNGRY_CH2_M  (AXI_DMA_IN_BUF_HUNGRY_CH2_V << AXI_DMA_IN_BUF_HUNGRY_CH2_S)
#define AXI_DMA_IN_BUF_HUNGRY_CH2_V  0x00000001U
#define AXI_DMA_IN_BUF_HUNGRY_CH2_S  31

/** AXI_DMA_IN_POP_CH2_REG register
 *  Pop control register of Rx channel 2
 */
#define AXI_DMA_IN_POP_CH2_REG (DR_REG_AXI_DMA_BASE + 0xec)
/** AXI_DMA_INFIFO_RDATA_CH2 : RO; bitpos: [11:0]; default: 2048;
 *  This register stores the data popping from AXI_DMA FIFO.
 */
#define AXI_DMA_INFIFO_RDATA_CH2    0x00000FFFU
#define AXI_DMA_INFIFO_RDATA_CH2_M  (AXI_DMA_INFIFO_RDATA_CH2_V << AXI_DMA_INFIFO_RDATA_CH2_S)
#define AXI_DMA_INFIFO_RDATA_CH2_V  0x00000FFFU
#define AXI_DMA_INFIFO_RDATA_CH2_S  0
/** AXI_DMA_INFIFO_POP_CH2 : WT; bitpos: [12]; default: 0;
 *  Set this bit to pop data from AXI_DMA FIFO.
 */
#define AXI_DMA_INFIFO_POP_CH2    (BIT(12))
#define AXI_DMA_INFIFO_POP_CH2_M  (AXI_DMA_INFIFO_POP_CH2_V << AXI_DMA_INFIFO_POP_CH2_S)
#define AXI_DMA_INFIFO_POP_CH2_V  0x00000001U
#define AXI_DMA_INFIFO_POP_CH2_S  12

/** AXI_DMA_IN_LINK1_CH2_REG register
 *  Link descriptor configure and control register of Rx channel 2
 */
#define AXI_DMA_IN_LINK1_CH2_REG (DR_REG_AXI_DMA_BASE + 0xf0)
/** AXI_DMA_INLINK_AUTO_RET_CH2 : R/W; bitpos: [0]; default: 1;
 *  Set this bit to return to current inlink descriptor's address when there are some
 *  errors in current receiving data.
 */
#define AXI_DMA_INLINK_AUTO_RET_CH2    (BIT(0))
#define AXI_DMA_INLINK_AUTO_RET_CH2_M  (AXI_DMA_INLINK_AUTO_RET_CH2_V << AXI_DMA_INLINK_AUTO_RET_CH2_S)
#define AXI_DMA_INLINK_AUTO_RET_CH2_V  0x00000001U
#define AXI_DMA_INLINK_AUTO_RET_CH2_S  0
/** AXI_DMA_INLINK_STOP_CH2 : WT; bitpos: [1]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define AXI_DMA_INLINK_STOP_CH2    (BIT(1))
#define AXI_DMA_INLINK_STOP_CH2_M  (AXI_DMA_INLINK_STOP_CH2_V << AXI_DMA_INLINK_STOP_CH2_S)
#define AXI_DMA_INLINK_STOP_CH2_V  0x00000001U
#define AXI_DMA_INLINK_STOP_CH2_S  1
/** AXI_DMA_INLINK_START_CH2 : WT; bitpos: [2]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define AXI_DMA_INLINK_START_CH2    (BIT(2))
#define AXI_DMA_INLINK_START_CH2_M  (AXI_DMA_INLINK_START_CH2_V << AXI_DMA_INLINK_START_CH2_S)
#define AXI_DMA_INLINK_START_CH2_V  0x00000001U
#define AXI_DMA_INLINK_START_CH2_S  2
/** AXI_DMA_INLINK_RESTART_CH2 : WT; bitpos: [3]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define AXI_DMA_INLINK_RESTART_CH2    (BIT(3))
#define AXI_DMA_INLINK_RESTART_CH2_M  (AXI_DMA_INLINK_RESTART_CH2_V << AXI_DMA_INLINK_RESTART_CH2_S)
#define AXI_DMA_INLINK_RESTART_CH2_V  0x00000001U
#define AXI_DMA_INLINK_RESTART_CH2_S  3
/** AXI_DMA_INLINK_PARK_CH2 : RO; bitpos: [4]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define AXI_DMA_INLINK_PARK_CH2    (BIT(4))
#define AXI_DMA_INLINK_PARK_CH2_M  (AXI_DMA_INLINK_PARK_CH2_V << AXI_DMA_INLINK_PARK_CH2_S)
#define AXI_DMA_INLINK_PARK_CH2_V  0x00000001U
#define AXI_DMA_INLINK_PARK_CH2_S  4

/** AXI_DMA_IN_LINK2_CH2_REG register
 *  Link descriptor configure and control register of Rx channel 2
 */
#define AXI_DMA_IN_LINK2_CH2_REG (DR_REG_AXI_DMA_BASE + 0xf4)
/** AXI_DMA_INLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the 20 least significant bits of the first inlink descriptor's
 *  address.
 */
#define AXI_DMA_INLINK_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_INLINK_ADDR_CH2_M  (AXI_DMA_INLINK_ADDR_CH2_V << AXI_DMA_INLINK_ADDR_CH2_S)
#define AXI_DMA_INLINK_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_ADDR_CH2_S  0

/** AXI_DMA_IN_STATE_CH2_REG register
 *  Receive status of Rx channel 2
 */
#define AXI_DMA_IN_STATE_CH2_REG (DR_REG_AXI_DMA_BASE + 0xf8)
/** AXI_DMA_INLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define AXI_DMA_INLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define AXI_DMA_INLINK_DSCR_ADDR_CH2_M  (AXI_DMA_INLINK_DSCR_ADDR_CH2_V << AXI_DMA_INLINK_DSCR_ADDR_CH2_S)
#define AXI_DMA_INLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define AXI_DMA_INLINK_DSCR_ADDR_CH2_S  0
/** AXI_DMA_IN_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_DSCR_STATE_CH2    0x00000003U
#define AXI_DMA_IN_DSCR_STATE_CH2_M  (AXI_DMA_IN_DSCR_STATE_CH2_V << AXI_DMA_IN_DSCR_STATE_CH2_S)
#define AXI_DMA_IN_DSCR_STATE_CH2_V  0x00000003U
#define AXI_DMA_IN_DSCR_STATE_CH2_S  18
/** AXI_DMA_IN_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_STATE_CH2    0x00000007U
#define AXI_DMA_IN_STATE_CH2_M  (AXI_DMA_IN_STATE_CH2_V << AXI_DMA_IN_STATE_CH2_S)
#define AXI_DMA_IN_STATE_CH2_V  0x00000007U
#define AXI_DMA_IN_STATE_CH2_S  20

/** AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG register
 *  Inlink descriptor address when EOF occurs of Rx channel 2
 */
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG (DR_REG_AXI_DMA_BASE + 0xfc)
/** AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_M  (AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_V << AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_S)
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH2_S  0

/** AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG register
 *  Inlink descriptor address when errors occur of Rx channel 2
 */
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x100)
/** AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data. Only used when peripheral is UHCI0.
 */
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_M  (AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_V << AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_S)
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH2_S  0

