espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_OUT_CRC_INIT_DATA_CH0_REG register
 *  This register is used to config ch0 crc initial data(max 32 bit)
 */
#define AXI_DMA_OUT_CRC_INIT_DATA_CH0_REG (DR_REG_AXI_DMA_BASE + 0x180)
/** AXI_DMA_OUT_CRC_INIT_DATA_CH0 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is used to config ch0 of tx crc initial value
 */
#define AXI_DMA_OUT_CRC_INIT_DATA_CH0    0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_INIT_DATA_CH0_M  (AXI_DMA_OUT_CRC_INIT_DATA_CH0_V << AXI_DMA_OUT_CRC_INIT_DATA_CH0_S)
#define AXI_DMA_OUT_CRC_INIT_DATA_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_INIT_DATA_CH0_S  0

/** AXI_DMA_TX_CRC_WIDTH_CH0_REG register
 *  This register is used to confiig tx ch0 crc result width,2'b00 mean crc_width
 *  <=8bit,2'b01 8<crc_width<=16 ,2'b10 mean 16<crc_width  <=24,2'b11 mean
 *  24<crc_width<=32
 */
#define AXI_DMA_TX_CRC_WIDTH_CH0_REG (DR_REG_AXI_DMA_BASE + 0x184)
/** AXI_DMA_TX_CRC_WIDTH_CH0 : R/W; bitpos: [1:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_WIDTH_CH0    0x00000003U
#define AXI_DMA_TX_CRC_WIDTH_CH0_M  (AXI_DMA_TX_CRC_WIDTH_CH0_V << AXI_DMA_TX_CRC_WIDTH_CH0_S)
#define AXI_DMA_TX_CRC_WIDTH_CH0_V  0x00000003U
#define AXI_DMA_TX_CRC_WIDTH_CH0_S  0
/** AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0 : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0    (BIT(2))
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0_M  (AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0_V << AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0_S)
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0_V  0x00000001U
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH0_S  2

/** AXI_DMA_OUT_CRC_CLEAR_CH0_REG register
 *  This register is used to clear ch0 crc result
 */
#define AXI_DMA_OUT_CRC_CLEAR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x188)
/** AXI_DMA_OUT_CRC_CLEAR_CH0 : R/W; bitpos: [0]; default: 0;
 *  This register is used to clear ch0 of tx crc result
 */
#define AXI_DMA_OUT_CRC_CLEAR_CH0    (BIT(0))
#define AXI_DMA_OUT_CRC_CLEAR_CH0_M  (AXI_DMA_OUT_CRC_CLEAR_CH0_V << AXI_DMA_OUT_CRC_CLEAR_CH0_S)
#define AXI_DMA_OUT_CRC_CLEAR_CH0_V  0x00000001U
#define AXI_DMA_OUT_CRC_CLEAR_CH0_S  0

/** AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_REG register
 *  This register is used to store ch0 crc result
 */
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_REG (DR_REG_AXI_DMA_BASE + 0x18c)
/** AXI_DMA_OUT_CRC_FINAL_RESULT_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register is used to store result ch0 of tx
 */
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH0    0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_M  (AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_V << AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_S)
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH0_S  0

/** AXI_DMA_TX_CRC_EN_WR_DATA_CH0_REG register
 *  This resister is used to config ch0 crc en for every bit
 */
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH0_REG (DR_REG_AXI_DMA_BASE + 0x190)
/** AXI_DMA_TX_CRC_EN_WR_DATA_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  This register is used to enable tx ch0 crc 32bit on/off
 */
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH0    0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH0_M  (AXI_DMA_TX_CRC_EN_WR_DATA_CH0_V << AXI_DMA_TX_CRC_EN_WR_DATA_CH0_S)
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH0_V  0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH0_S  0

/** AXI_DMA_TX_CRC_EN_ADDR_CH0_REG register
 *  This register is used to config ch0 crc en addr
 */
#define AXI_DMA_TX_CRC_EN_ADDR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x194)
/** AXI_DMA_TX_CRC_EN_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_EN_ADDR_CH0    0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_ADDR_CH0_M  (AXI_DMA_TX_CRC_EN_ADDR_CH0_V << AXI_DMA_TX_CRC_EN_ADDR_CH0_S)
#define AXI_DMA_TX_CRC_EN_ADDR_CH0_V  0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_ADDR_CH0_S  0

/** AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_REG register
 *  This register is used to config crc data_8bit en
 */
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_REG (DR_REG_AXI_DMA_BASE + 0x198)
/** AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0 : R/W; bitpos: [15:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0    0x0000FFFFU
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_M  (AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_V << AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_S)
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_V  0x0000FFFFU
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH0_S  0

/** AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_REG register
 *  This register is used to config addr of crc data_8bit en
 */
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x19c)
/** AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0    0xFFFFFFFFU
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_M  (AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_V << AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_S)
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_V  0xFFFFFFFFU
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH0_S  0

/** AXI_DMA_OUT_INT_RAW_CH1_REG register
 *  Raw status interrupt of channel1
 */
#define AXI_DMA_OUT_INT_RAW_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1a0)
/** AXI_DMA_OUT_DONE_CH1_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel0.
 */
#define AXI_DMA_OUT_DONE_CH1_INT_RAW    (BIT(0))
#define AXI_DMA_OUT_DONE_CH1_INT_RAW_M  (AXI_DMA_OUT_DONE_CH1_INT_RAW_V << AXI_DMA_OUT_DONE_CH1_INT_RAW_S)
#define AXI_DMA_OUT_DONE_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH1_INT_RAW_S  0
/** AXI_DMA_OUT_EOF_CH1_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel0.
 */
#define AXI_DMA_OUT_EOF_CH1_INT_RAW    (BIT(1))
#define AXI_DMA_OUT_EOF_CH1_INT_RAW_M  (AXI_DMA_OUT_EOF_CH1_INT_RAW_V << AXI_DMA_OUT_EOF_CH1_INT_RAW_S)
#define AXI_DMA_OUT_EOF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH1_INT_RAW_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error
 *  including owner error and the second and third word error of outlink descriptor for
 *  Tx channel0.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW_M  (AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW_V << AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW_S)
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_RAW_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel0.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW_M  (AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW_V << AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_RAW_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW_M  (AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW_V << AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_RAW_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW_M  (AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW_V << AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_RAW_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW_M  (AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW_V << AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_RAW_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW_M  (AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW_V << AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_RAW_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW_M  (AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW_V << AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_RAW_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW_M  (AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW_V << AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_RAW_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when the dma switch to new link for Tx
 *  channel0.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW_M  (AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW_V << AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_RAW_S  10

/** AXI_DMA_OUT_INT_ST_CH1_REG register
 *  Masked interrupt of channel1
 */
#define AXI_DMA_OUT_INT_ST_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1a4)
/** AXI_DMA_OUT_DONE_CH1_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH1_INT_ST    (BIT(0))
#define AXI_DMA_OUT_DONE_CH1_INT_ST_M  (AXI_DMA_OUT_DONE_CH1_INT_ST_V << AXI_DMA_OUT_DONE_CH1_INT_ST_S)
#define AXI_DMA_OUT_DONE_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH1_INT_ST_S  0
/** AXI_DMA_OUT_EOF_CH1_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH1_INT_ST    (BIT(1))
#define AXI_DMA_OUT_EOF_CH1_INT_ST_M  (AXI_DMA_OUT_EOF_CH1_INT_ST_V << AXI_DMA_OUT_EOF_CH1_INT_ST_S)
#define AXI_DMA_OUT_EOF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH1_INT_ST_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST_M  (AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST_V << AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST_S)
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ST_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST_M  (AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST_V << AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ST_S  3
/** AXI_DMA_OUTFIFO_OVF_CH1_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_OVF_CH1_INT_ST    (BIT(4))
#define AXI_DMA_OUTFIFO_OVF_CH1_INT_ST_M  (AXI_DMA_OUTFIFO_OVF_CH1_INT_ST_V << AXI_DMA_OUTFIFO_OVF_CH1_INT_ST_S)
#define AXI_DMA_OUTFIFO_OVF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_OVF_CH1_INT_ST_S  4
/** AXI_DMA_OUTFIFO_UDF_CH1_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_UDF_CH1_INT_ST    (BIT(5))
#define AXI_DMA_OUTFIFO_UDF_CH1_INT_ST_M  (AXI_DMA_OUTFIFO_UDF_CH1_INT_ST_V << AXI_DMA_OUTFIFO_UDF_CH1_INT_ST_S)
#define AXI_DMA_OUTFIFO_UDF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_UDF_CH1_INT_ST_S  5
/** AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST    (BIT(6))
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST_M  (AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST_V << AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ST_S  6
/** AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST    (BIT(7))
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST_M  (AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST_V << AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ST_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST_M  (AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST_V << AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ST_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST_M  (AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST_V << AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ST_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST_M  (AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST_V << AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ST_S  10

/** AXI_DMA_OUT_INT_ENA_CH1_REG register
 *  Interrupt enable bits of channel1
 */
#define AXI_DMA_OUT_INT_ENA_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1a8)
/** AXI_DMA_OUT_DONE_CH1_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH1_INT_ENA    (BIT(0))
#define AXI_DMA_OUT_DONE_CH1_INT_ENA_M  (AXI_DMA_OUT_DONE_CH1_INT_ENA_V << AXI_DMA_OUT_DONE_CH1_INT_ENA_S)
#define AXI_DMA_OUT_DONE_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH1_INT_ENA_S  0
/** AXI_DMA_OUT_EOF_CH1_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH1_INT_ENA    (BIT(1))
#define AXI_DMA_OUT_EOF_CH1_INT_ENA_M  (AXI_DMA_OUT_EOF_CH1_INT_ENA_V << AXI_DMA_OUT_EOF_CH1_INT_ENA_S)
#define AXI_DMA_OUT_EOF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH1_INT_ENA_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA_M  (AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA_V << AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA_S)
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_ENA_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA_M  (AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA_V << AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_ENA_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA_M  (AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA_V << AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_ENA_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA_M  (AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA_V << AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_ENA_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA_M  (AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA_V << AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_ENA_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA_M  (AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA_V << AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_ENA_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA_M  (AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA_V << AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_ENA_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA_M  (AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA_V << AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_ENA_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA_M  (AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA_V << AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_ENA_S  10

