espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_OUT_INT_CLR_CH1_REG register
 *  Interrupt clear bits of channel1
 */
#define AXI_DMA_OUT_INT_CLR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1ac)
/** AXI_DMA_OUT_DONE_CH1_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH1_INT_CLR    (BIT(0))
#define AXI_DMA_OUT_DONE_CH1_INT_CLR_M  (AXI_DMA_OUT_DONE_CH1_INT_CLR_V << AXI_DMA_OUT_DONE_CH1_INT_CLR_S)
#define AXI_DMA_OUT_DONE_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH1_INT_CLR_S  0
/** AXI_DMA_OUT_EOF_CH1_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH1_INT_CLR    (BIT(1))
#define AXI_DMA_OUT_EOF_CH1_INT_CLR_M  (AXI_DMA_OUT_EOF_CH1_INT_CLR_V << AXI_DMA_OUT_EOF_CH1_INT_CLR_S)
#define AXI_DMA_OUT_EOF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH1_INT_CLR_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR_M  (AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR_V << AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR_S)
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH1_INT_CLR_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_M  (AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_V << AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH1_INT_CLR_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR_M  (AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR_V << AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_INT_CLR_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR_M  (AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR_V << AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_INT_CLR_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR_M  (AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR_V << AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_INT_CLR_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR_M  (AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR_V << AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_INT_CLR_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR_M  (AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR_V << AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_INT_CLR_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR_M  (AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR_V << AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_INT_CLR_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR_M  (AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR_V << AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH1_INT_CLR_S  10

/** AXI_DMA_OUT_CONF0_CH1_REG register
 *  Configure 0 register of Tx channel1
 */
#define AXI_DMA_OUT_CONF0_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1b0)
/** AXI_DMA_OUT_RST_CH1 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to reset AXI_DMA channel1 Tx FSM and Tx FIFO pointer.
 */
#define AXI_DMA_OUT_RST_CH1    (BIT(0))
#define AXI_DMA_OUT_RST_CH1_M  (AXI_DMA_OUT_RST_CH1_V << AXI_DMA_OUT_RST_CH1_S)
#define AXI_DMA_OUT_RST_CH1_V  0x00000001U
#define AXI_DMA_OUT_RST_CH1_S  0
/** AXI_DMA_OUT_LOOP_TEST_CH1 : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_LOOP_TEST_CH1    (BIT(1))
#define AXI_DMA_OUT_LOOP_TEST_CH1_M  (AXI_DMA_OUT_LOOP_TEST_CH1_V << AXI_DMA_OUT_LOOP_TEST_CH1_S)
#define AXI_DMA_OUT_LOOP_TEST_CH1_V  0x00000001U
#define AXI_DMA_OUT_LOOP_TEST_CH1_S  1
/** AXI_DMA_OUT_AUTO_WRBACK_CH1 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to enable automatic outlink-writeback when all the data in tx buffer
 *  has been transmitted.
 */
#define AXI_DMA_OUT_AUTO_WRBACK_CH1    (BIT(2))
#define AXI_DMA_OUT_AUTO_WRBACK_CH1_M  (AXI_DMA_OUT_AUTO_WRBACK_CH1_V << AXI_DMA_OUT_AUTO_WRBACK_CH1_S)
#define AXI_DMA_OUT_AUTO_WRBACK_CH1_V  0x00000001U
#define AXI_DMA_OUT_AUTO_WRBACK_CH1_S  2
/** AXI_DMA_OUT_EOF_MODE_CH1 : R/W; bitpos: [3]; default: 1;
 *  EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel1 is
 *  generated when data need to transmit has been popped from FIFO in AXI_DMA
 */
#define AXI_DMA_OUT_EOF_MODE_CH1    (BIT(3))
#define AXI_DMA_OUT_EOF_MODE_CH1_M  (AXI_DMA_OUT_EOF_MODE_CH1_V << AXI_DMA_OUT_EOF_MODE_CH1_S)
#define AXI_DMA_OUT_EOF_MODE_CH1_V  0x00000001U
#define AXI_DMA_OUT_EOF_MODE_CH1_S  3
/** AXI_DMA_OUT_ETM_EN_CH1 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to 1 to enable etm control mode, dma Tx channel1 is triggered by etm
 *  task.
 */
#define AXI_DMA_OUT_ETM_EN_CH1    (BIT(4))
#define AXI_DMA_OUT_ETM_EN_CH1_M  (AXI_DMA_OUT_ETM_EN_CH1_V << AXI_DMA_OUT_ETM_EN_CH1_S)
#define AXI_DMA_OUT_ETM_EN_CH1_V  0x00000001U
#define AXI_DMA_OUT_ETM_EN_CH1_S  4
/** AXI_DMA_OUT_BURST_SIZE_SEL_CH1 : R/W; bitpos: [7:5]; default: 0;
 *  3'b000-3'b100:burst length 8byte~128byte
 */
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH1    0x00000007U
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH1_M  (AXI_DMA_OUT_BURST_SIZE_SEL_CH1_V << AXI_DMA_OUT_BURST_SIZE_SEL_CH1_S)
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH1_V  0x00000007U
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH1_S  5
/** AXI_DMA_OUT_CMD_DISABLE_CH1 : R/W; bitpos: [8]; default: 0;
 *  1:mean disable cmd of this ch1
 */
#define AXI_DMA_OUT_CMD_DISABLE_CH1    (BIT(8))
#define AXI_DMA_OUT_CMD_DISABLE_CH1_M  (AXI_DMA_OUT_CMD_DISABLE_CH1_V << AXI_DMA_OUT_CMD_DISABLE_CH1_S)
#define AXI_DMA_OUT_CMD_DISABLE_CH1_V  0x00000001U
#define AXI_DMA_OUT_CMD_DISABLE_CH1_S  8
/** AXI_DMA_OUT_ECC_AEC_EN_CH1 : R/W; bitpos: [9]; default: 0;
 *  1: mean access ecc or aes domain,0: mean not
 */
#define AXI_DMA_OUT_ECC_AEC_EN_CH1    (BIT(9))
#define AXI_DMA_OUT_ECC_AEC_EN_CH1_M  (AXI_DMA_OUT_ECC_AEC_EN_CH1_V << AXI_DMA_OUT_ECC_AEC_EN_CH1_S)
#define AXI_DMA_OUT_ECC_AEC_EN_CH1_V  0x00000001U
#define AXI_DMA_OUT_ECC_AEC_EN_CH1_S  9
/** AXI_DMA_OUTDSCR_BURST_EN_CH1 : R/W; bitpos: [10]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Tx channel1 reading link
 *  descriptor when accessing internal SRAM.
 */
#define AXI_DMA_OUTDSCR_BURST_EN_CH1    (BIT(10))
#define AXI_DMA_OUTDSCR_BURST_EN_CH1_M  (AXI_DMA_OUTDSCR_BURST_EN_CH1_V << AXI_DMA_OUTDSCR_BURST_EN_CH1_S)
#define AXI_DMA_OUTDSCR_BURST_EN_CH1_V  0x00000001U
#define AXI_DMA_OUTDSCR_BURST_EN_CH1_S  10

/** AXI_DMA_OUT_CONF1_CH1_REG register
 *  Configure 1 register of Tx channel1
 */
#define AXI_DMA_OUT_CONF1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1b4)
/** AXI_DMA_OUT_CHECK_OWNER_CH1 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define AXI_DMA_OUT_CHECK_OWNER_CH1    (BIT(12))
#define AXI_DMA_OUT_CHECK_OWNER_CH1_M  (AXI_DMA_OUT_CHECK_OWNER_CH1_V << AXI_DMA_OUT_CHECK_OWNER_CH1_S)
#define AXI_DMA_OUT_CHECK_OWNER_CH1_V  0x00000001U
#define AXI_DMA_OUT_CHECK_OWNER_CH1_S  12

/** AXI_DMA_OUTFIFO_STATUS_CH1_REG register
 *  Transmit FIFO status of Tx channel1
 */
#define AXI_DMA_OUTFIFO_STATUS_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1b8)
/** AXI_DMA_OUTFIFO_L3_FULL_CH1 : RO; bitpos: [0]; default: 0;
 *  L3 Tx FIFO full signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_FULL_CH1    (BIT(0))
#define AXI_DMA_OUTFIFO_L3_FULL_CH1_M  (AXI_DMA_OUTFIFO_L3_FULL_CH1_V << AXI_DMA_OUTFIFO_L3_FULL_CH1_S)
#define AXI_DMA_OUTFIFO_L3_FULL_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_FULL_CH1_S  0
/** AXI_DMA_OUTFIFO_L3_EMPTY_CH1 : RO; bitpos: [1]; default: 1;
 *  L3 Tx FIFO empty signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH1    (BIT(1))
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH1_M  (AXI_DMA_OUTFIFO_L3_EMPTY_CH1_V << AXI_DMA_OUTFIFO_L3_EMPTY_CH1_S)
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH1_S  1
/** AXI_DMA_OUTFIFO_L3_CNT_CH1 : RO; bitpos: [7:2]; default: 0;
 *  The register stores the byte number of the data in L3 Tx FIFO for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_CNT_CH1    0x0000003FU
#define AXI_DMA_OUTFIFO_L3_CNT_CH1_M  (AXI_DMA_OUTFIFO_L3_CNT_CH1_V << AXI_DMA_OUTFIFO_L3_CNT_CH1_S)
#define AXI_DMA_OUTFIFO_L3_CNT_CH1_V  0x0000003FU
#define AXI_DMA_OUTFIFO_L3_CNT_CH1_S  2
/** AXI_DMA_OUTFIFO_L3_UDF_CH1 : RO; bitpos: [8]; default: 0;
 *  L3 Tx FIFO under flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH1    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_M  (AXI_DMA_OUTFIFO_L3_UDF_CH1_V << AXI_DMA_OUTFIFO_L3_UDF_CH1_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH1_S  8
/** AXI_DMA_OUTFIFO_L3_OVF_CH1 : RO; bitpos: [9]; default: 0;
 *  L3 Tx FIFO over flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH1    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_M  (AXI_DMA_OUTFIFO_L3_OVF_CH1_V << AXI_DMA_OUTFIFO_L3_OVF_CH1_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH1_S  9
/** AXI_DMA_OUTFIFO_L1_FULL_CH1 : RO; bitpos: [10]; default: 0;
 *  L1 Tx FIFO full signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_FULL_CH1    (BIT(10))
#define AXI_DMA_OUTFIFO_L1_FULL_CH1_M  (AXI_DMA_OUTFIFO_L1_FULL_CH1_V << AXI_DMA_OUTFIFO_L1_FULL_CH1_S)
#define AXI_DMA_OUTFIFO_L1_FULL_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_FULL_CH1_S  10
/** AXI_DMA_OUTFIFO_L1_EMPTY_CH1 : RO; bitpos: [11]; default: 1;
 *  L1 Tx FIFO empty signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH1    (BIT(11))
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH1_M  (AXI_DMA_OUTFIFO_L1_EMPTY_CH1_V << AXI_DMA_OUTFIFO_L1_EMPTY_CH1_S)
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH1_S  11
/** AXI_DMA_OUTFIFO_L1_UDF_CH1 : RO; bitpos: [12]; default: 0;
 *  L1 Tx FIFO under flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH1    (BIT(12))
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_M  (AXI_DMA_OUTFIFO_L1_UDF_CH1_V << AXI_DMA_OUTFIFO_L1_UDF_CH1_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH1_S  12
/** AXI_DMA_OUTFIFO_L1_OVF_CH1 : RO; bitpos: [13]; default: 0;
 *  L1 Tx FIFO over flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH1    (BIT(13))
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_M  (AXI_DMA_OUTFIFO_L1_OVF_CH1_V << AXI_DMA_OUTFIFO_L1_OVF_CH1_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH1_S  13
/** AXI_DMA_OUTFIFO_L2_FULL_CH1 : RO; bitpos: [14]; default: 0;
 *  L2 Tx RAM full signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_FULL_CH1    (BIT(14))
#define AXI_DMA_OUTFIFO_L2_FULL_CH1_M  (AXI_DMA_OUTFIFO_L2_FULL_CH1_V << AXI_DMA_OUTFIFO_L2_FULL_CH1_S)
#define AXI_DMA_OUTFIFO_L2_FULL_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_FULL_CH1_S  14
/** AXI_DMA_OUTFIFO_L2_EMPTY_CH1 : RO; bitpos: [15]; default: 1;
 *  L2 Tx RAM empty signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH1    (BIT(15))
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH1_M  (AXI_DMA_OUTFIFO_L2_EMPTY_CH1_V << AXI_DMA_OUTFIFO_L2_EMPTY_CH1_S)
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH1_S  15
/** AXI_DMA_OUTFIFO_L2_UDF_CH1 : RO; bitpos: [16]; default: 0;
 *  L2 Tx FIFO under flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH1    (BIT(16))
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_M  (AXI_DMA_OUTFIFO_L2_UDF_CH1_V << AXI_DMA_OUTFIFO_L2_UDF_CH1_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH1_S  16
/** AXI_DMA_OUTFIFO_L2_OVF_CH1 : RO; bitpos: [17]; default: 0;
 *  L2 Tx FIFO over flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH1    (BIT(17))
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_M  (AXI_DMA_OUTFIFO_L2_OVF_CH1_V << AXI_DMA_OUTFIFO_L2_OVF_CH1_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH1_S  17
/** AXI_DMA_OUT_REMAIN_UNDER_1B_CH1 : RO; bitpos: [23]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH1    (BIT(23))
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_1B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_1B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH1_S  23
/** AXI_DMA_OUT_REMAIN_UNDER_2B_CH1 : RO; bitpos: [24]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH1    (BIT(24))
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_2B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_2B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH1_S  24
/** AXI_DMA_OUT_REMAIN_UNDER_3B_CH1 : RO; bitpos: [25]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH1    (BIT(25))
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_3B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_3B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH1_S  25
/** AXI_DMA_OUT_REMAIN_UNDER_4B_CH1 : RO; bitpos: [26]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH1    (BIT(26))
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_4B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_4B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH1_S  26
/** AXI_DMA_OUT_REMAIN_UNDER_5B_CH1 : RO; bitpos: [27]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH1    (BIT(27))
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_5B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_5B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH1_S  27
/** AXI_DMA_OUT_REMAIN_UNDER_6B_CH1 : RO; bitpos: [28]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH1    (BIT(28))
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_6B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_6B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH1_S  28
/** AXI_DMA_OUT_REMAIN_UNDER_7B_CH1 : RO; bitpos: [29]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH1    (BIT(29))
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_7B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_7B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH1_S  29
/** AXI_DMA_OUT_REMAIN_UNDER_8B_CH1 : RO; bitpos: [30]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH1    (BIT(30))
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH1_M  (AXI_DMA_OUT_REMAIN_UNDER_8B_CH1_V << AXI_DMA_OUT_REMAIN_UNDER_8B_CH1_S)
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH1_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH1_S  30

