espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_OUT_PUSH_CH1_REG register
 *  Push control register of Tx channel1
 */
#define AXI_DMA_OUT_PUSH_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1bc)
/** AXI_DMA_OUTFIFO_WDATA_CH1 : R/W; bitpos: [8:0]; default: 0;
 *  This register stores the data that need to be pushed into AXI_DMA FIFO.
 */
#define AXI_DMA_OUTFIFO_WDATA_CH1    0x000001FFU
#define AXI_DMA_OUTFIFO_WDATA_CH1_M  (AXI_DMA_OUTFIFO_WDATA_CH1_V << AXI_DMA_OUTFIFO_WDATA_CH1_S)
#define AXI_DMA_OUTFIFO_WDATA_CH1_V  0x000001FFU
#define AXI_DMA_OUTFIFO_WDATA_CH1_S  0
/** AXI_DMA_OUTFIFO_PUSH_CH1 : WT; bitpos: [9]; default: 0;
 *  Set this bit to push data into AXI_DMA FIFO.
 */
#define AXI_DMA_OUTFIFO_PUSH_CH1    (BIT(9))
#define AXI_DMA_OUTFIFO_PUSH_CH1_M  (AXI_DMA_OUTFIFO_PUSH_CH1_V << AXI_DMA_OUTFIFO_PUSH_CH1_S)
#define AXI_DMA_OUTFIFO_PUSH_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_PUSH_CH1_S  9

/** AXI_DMA_OUT_LINK1_CH1_REG register
 *  Link descriptor configure and control register of Tx channel1
 */
#define AXI_DMA_OUT_LINK1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1c0)
/** AXI_DMA_OUTLINK_STOP_CH1 : WT; bitpos: [0]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define AXI_DMA_OUTLINK_STOP_CH1    (BIT(0))
#define AXI_DMA_OUTLINK_STOP_CH1_M  (AXI_DMA_OUTLINK_STOP_CH1_V << AXI_DMA_OUTLINK_STOP_CH1_S)
#define AXI_DMA_OUTLINK_STOP_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_STOP_CH1_S  0
/** AXI_DMA_OUTLINK_START_CH1 : WT; bitpos: [1]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define AXI_DMA_OUTLINK_START_CH1    (BIT(1))
#define AXI_DMA_OUTLINK_START_CH1_M  (AXI_DMA_OUTLINK_START_CH1_V << AXI_DMA_OUTLINK_START_CH1_S)
#define AXI_DMA_OUTLINK_START_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_START_CH1_S  1
/** AXI_DMA_OUTLINK_RESTART_CH1 : WT; bitpos: [2]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define AXI_DMA_OUTLINK_RESTART_CH1    (BIT(2))
#define AXI_DMA_OUTLINK_RESTART_CH1_M  (AXI_DMA_OUTLINK_RESTART_CH1_V << AXI_DMA_OUTLINK_RESTART_CH1_S)
#define AXI_DMA_OUTLINK_RESTART_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_RESTART_CH1_S  2
/** AXI_DMA_OUTLINK_PARK_CH1 : RO; bitpos: [3]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define AXI_DMA_OUTLINK_PARK_CH1    (BIT(3))
#define AXI_DMA_OUTLINK_PARK_CH1_M  (AXI_DMA_OUTLINK_PARK_CH1_V << AXI_DMA_OUTLINK_PARK_CH1_S)
#define AXI_DMA_OUTLINK_PARK_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_PARK_CH1_S  3

/** AXI_DMA_OUT_LINK2_CH1_REG register
 *  Link descriptor configure and control register of Tx channel1
 */
#define AXI_DMA_OUT_LINK2_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1c4)
/** AXI_DMA_OUTLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the 32 least significant bits of the first outlink
 *  descriptor's address.
 */
#define AXI_DMA_OUTLINK_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH1_M  (AXI_DMA_OUTLINK_ADDR_CH1_V << AXI_DMA_OUTLINK_ADDR_CH1_S)
#define AXI_DMA_OUTLINK_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH1_S  0

/** AXI_DMA_OUT_STATE_CH1_REG register
 *  Transmit status of Tx channel1
 */
#define AXI_DMA_OUT_STATE_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1c8)
/** AXI_DMA_OUTLINK_DSCR_ADDR_CH1 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1    0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1_M  (AXI_DMA_OUTLINK_DSCR_ADDR_CH1_V << AXI_DMA_OUTLINK_DSCR_ADDR_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1_V  0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1_S  0
/** AXI_DMA_OUT_DSCR_STATE_CH1 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_DSCR_STATE_CH1    0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH1_M  (AXI_DMA_OUT_DSCR_STATE_CH1_V << AXI_DMA_OUT_DSCR_STATE_CH1_S)
#define AXI_DMA_OUT_DSCR_STATE_CH1_V  0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH1_S  18
/** AXI_DMA_OUT_STATE_CH1 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_STATE_CH1    0x00000007U
#define AXI_DMA_OUT_STATE_CH1_M  (AXI_DMA_OUT_STATE_CH1_V << AXI_DMA_OUT_STATE_CH1_S)
#define AXI_DMA_OUT_STATE_CH1_V  0x00000007U
#define AXI_DMA_OUT_STATE_CH1_S  20

/** AXI_DMA_OUT_EOF_DES_ADDR_CH1_REG register
 *  Outlink descriptor address when EOF occurs of Tx channel1
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1cc)
/** AXI_DMA_OUT_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_M  (AXI_DMA_OUT_EOF_DES_ADDR_CH1_V << AXI_DMA_OUT_EOF_DES_ADDR_CH1_S)
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_S  0

/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_REG register
 *  The last outlink descriptor address when EOF occurs of Tx channel1
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1d0)
/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor before the last outlink
 *  descriptor.
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_M  (AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_V << AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_S)
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_S  0

/** AXI_DMA_OUT_DSCR_CH1_REG register
 *  Current outlink descriptor address of Tx channel1
 */
#define AXI_DMA_OUT_DSCR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1d4)
/** AXI_DMA_OUTLINK_DSCR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define AXI_DMA_OUTLINK_DSCR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH1_M  (AXI_DMA_OUTLINK_DSCR_CH1_V << AXI_DMA_OUTLINK_DSCR_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH1_S  0

/** AXI_DMA_OUT_DSCR_BF0_CH1_REG register
 *  The last outlink descriptor address of Tx channel1
 */
#define AXI_DMA_OUT_DSCR_BF0_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1d8)
/** AXI_DMA_OUTLINK_DSCR_BF0_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1_M  (AXI_DMA_OUTLINK_DSCR_BF0_CH1_V << AXI_DMA_OUTLINK_DSCR_BF0_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1_S  0

/** AXI_DMA_OUT_DSCR_BF1_CH1_REG register
 *  The second-to-last outlink descriptor address of Tx channel1
 */
#define AXI_DMA_OUT_DSCR_BF1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1dc)
/** AXI_DMA_OUTLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor x-2.
 */
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1_M  (AXI_DMA_OUTLINK_DSCR_BF1_CH1_V << AXI_DMA_OUTLINK_DSCR_BF1_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1_S  0

/** AXI_DMA_OUT_PRI_CH1_REG register
 *  Priority register of Tx channel1.
 */
#define AXI_DMA_OUT_PRI_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1e0)
/** AXI_DMA_TX_PRI_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Tx channel0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_TX_PRI_CH1    0x0000000FU
#define AXI_DMA_TX_PRI_CH1_M  (AXI_DMA_TX_PRI_CH1_V << AXI_DMA_TX_PRI_CH1_S)
#define AXI_DMA_TX_PRI_CH1_V  0x0000000FU
#define AXI_DMA_TX_PRI_CH1_S  0
/** AXI_DMA_TX_CH_ARB_WEIGH_CH1 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Tx channel0
 */
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1    0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1_M  (AXI_DMA_TX_CH_ARB_WEIGH_CH1_V << AXI_DMA_TX_CH_ARB_WEIGH_CH1_S)
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1_V  0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1_S  4
/** AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1    (BIT(8))
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_M  (AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_V << AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_S)
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_V  0x00000001U
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_S  8

/** AXI_DMA_OUT_PERI_SEL_CH1_REG register
 *  Peripheral selection of Tx channel1
 */
#define AXI_DMA_OUT_PERI_SEL_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1e4)
/** AXI_DMA_PERI_OUT_SEL_CH1 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_OUT_SEL_CH1    0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH1_M  (AXI_DMA_PERI_OUT_SEL_CH1_V << AXI_DMA_PERI_OUT_SEL_CH1_S)
#define AXI_DMA_PERI_OUT_SEL_CH1_V  0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH1_S  0

/** AXI_DMA_OUT_CRC_INIT_DATA_CH1_REG register
 *  This register is used to config ch1 crc initial data(max 32 bit)
 */
#define AXI_DMA_OUT_CRC_INIT_DATA_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1e8)
/** AXI_DMA_OUT_CRC_INIT_DATA_CH1 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is used to config ch0 of tx crc initial value
 */
#define AXI_DMA_OUT_CRC_INIT_DATA_CH1    0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_INIT_DATA_CH1_M  (AXI_DMA_OUT_CRC_INIT_DATA_CH1_V << AXI_DMA_OUT_CRC_INIT_DATA_CH1_S)
#define AXI_DMA_OUT_CRC_INIT_DATA_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_INIT_DATA_CH1_S  0

/** AXI_DMA_TX_CRC_WIDTH_CH1_REG register
 *  This register is used to confiig tx ch1 crc result width,2'b00 mean crc_width
 *  <=8bit,2'b01 8<crc_width<=16 ,2'b10 mean 16<crc_width  <=24,2'b11 mean
 *  24<crc_width<=32
 */
#define AXI_DMA_TX_CRC_WIDTH_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1ec)
/** AXI_DMA_TX_CRC_WIDTH_CH1 : R/W; bitpos: [1:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_WIDTH_CH1    0x00000003U
#define AXI_DMA_TX_CRC_WIDTH_CH1_M  (AXI_DMA_TX_CRC_WIDTH_CH1_V << AXI_DMA_TX_CRC_WIDTH_CH1_S)
#define AXI_DMA_TX_CRC_WIDTH_CH1_V  0x00000003U
#define AXI_DMA_TX_CRC_WIDTH_CH1_S  0
/** AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1 : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1    (BIT(2))
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1_M  (AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1_V << AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1_S)
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1_V  0x00000001U
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH1_S  2

