espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_OUTFIFO_STATUS_CH2_REG register
 *  Transmit FIFO status of Tx channel2
 */
#define AXI_DMA_OUTFIFO_STATUS_CH2_REG (DR_REG_AXI_DMA_BASE + 0x220)
/** AXI_DMA_OUTFIFO_L3_FULL_CH2 : RO; bitpos: [0]; default: 0;
 *  L3 Tx FIFO full signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_FULL_CH2    (BIT(0))
#define AXI_DMA_OUTFIFO_L3_FULL_CH2_M  (AXI_DMA_OUTFIFO_L3_FULL_CH2_V << AXI_DMA_OUTFIFO_L3_FULL_CH2_S)
#define AXI_DMA_OUTFIFO_L3_FULL_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_FULL_CH2_S  0
/** AXI_DMA_OUTFIFO_L3_EMPTY_CH2 : RO; bitpos: [1]; default: 1;
 *  L3 Tx FIFO empty signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH2    (BIT(1))
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH2_M  (AXI_DMA_OUTFIFO_L3_EMPTY_CH2_V << AXI_DMA_OUTFIFO_L3_EMPTY_CH2_S)
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_EMPTY_CH2_S  1
/** AXI_DMA_OUTFIFO_L3_CNT_CH2 : RO; bitpos: [7:2]; default: 0;
 *  The register stores the byte number of the data in L3 Tx FIFO for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_CNT_CH2    0x0000003FU
#define AXI_DMA_OUTFIFO_L3_CNT_CH2_M  (AXI_DMA_OUTFIFO_L3_CNT_CH2_V << AXI_DMA_OUTFIFO_L3_CNT_CH2_S)
#define AXI_DMA_OUTFIFO_L3_CNT_CH2_V  0x0000003FU
#define AXI_DMA_OUTFIFO_L3_CNT_CH2_S  2
/** AXI_DMA_OUTFIFO_L3_UDF_CH2 : RO; bitpos: [8]; default: 0;
 *  L3 Tx FIFO under flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH2    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_M  (AXI_DMA_OUTFIFO_L3_UDF_CH2_V << AXI_DMA_OUTFIFO_L3_UDF_CH2_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_S  8
/** AXI_DMA_OUTFIFO_L3_OVF_CH2 : RO; bitpos: [9]; default: 0;
 *  L3 Tx FIFO over flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH2    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_M  (AXI_DMA_OUTFIFO_L3_OVF_CH2_V << AXI_DMA_OUTFIFO_L3_OVF_CH2_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_S  9
/** AXI_DMA_OUTFIFO_L1_FULL_CH2 : RO; bitpos: [10]; default: 0;
 *  L1 Tx FIFO full signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_FULL_CH2    (BIT(10))
#define AXI_DMA_OUTFIFO_L1_FULL_CH2_M  (AXI_DMA_OUTFIFO_L1_FULL_CH2_V << AXI_DMA_OUTFIFO_L1_FULL_CH2_S)
#define AXI_DMA_OUTFIFO_L1_FULL_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_FULL_CH2_S  10
/** AXI_DMA_OUTFIFO_L1_EMPTY_CH2 : RO; bitpos: [11]; default: 1;
 *  L1 Tx FIFO empty signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH2    (BIT(11))
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH2_M  (AXI_DMA_OUTFIFO_L1_EMPTY_CH2_V << AXI_DMA_OUTFIFO_L1_EMPTY_CH2_S)
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_EMPTY_CH2_S  11
/** AXI_DMA_OUTFIFO_L1_UDF_CH2 : RO; bitpos: [12]; default: 0;
 *  L1 Tx FIFO under flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH2    (BIT(12))
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_M  (AXI_DMA_OUTFIFO_L1_UDF_CH2_V << AXI_DMA_OUTFIFO_L1_UDF_CH2_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_S  12
/** AXI_DMA_OUTFIFO_L1_OVF_CH2 : RO; bitpos: [13]; default: 0;
 *  L1 Tx FIFO over flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH2    (BIT(13))
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_M  (AXI_DMA_OUTFIFO_L1_OVF_CH2_V << AXI_DMA_OUTFIFO_L1_OVF_CH2_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_S  13
/** AXI_DMA_OUTFIFO_L2_FULL_CH2 : RO; bitpos: [14]; default: 0;
 *  L2 Tx RAM full signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_FULL_CH2    (BIT(14))
#define AXI_DMA_OUTFIFO_L2_FULL_CH2_M  (AXI_DMA_OUTFIFO_L2_FULL_CH2_V << AXI_DMA_OUTFIFO_L2_FULL_CH2_S)
#define AXI_DMA_OUTFIFO_L2_FULL_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_FULL_CH2_S  14
/** AXI_DMA_OUTFIFO_L2_EMPTY_CH2 : RO; bitpos: [15]; default: 1;
 *  L2 Tx RAM empty signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH2    (BIT(15))
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH2_M  (AXI_DMA_OUTFIFO_L2_EMPTY_CH2_V << AXI_DMA_OUTFIFO_L2_EMPTY_CH2_S)
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_EMPTY_CH2_S  15
/** AXI_DMA_OUTFIFO_L2_UDF_CH2 : RO; bitpos: [16]; default: 0;
 *  L2 Tx FIFO under flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH2    (BIT(16))
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_M  (AXI_DMA_OUTFIFO_L2_UDF_CH2_V << AXI_DMA_OUTFIFO_L2_UDF_CH2_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_S  16
/** AXI_DMA_OUTFIFO_L2_OVF_CH2 : RO; bitpos: [17]; default: 0;
 *  L2 Tx FIFO over flow signal for Tx channel0.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH2    (BIT(17))
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_M  (AXI_DMA_OUTFIFO_L2_OVF_CH2_V << AXI_DMA_OUTFIFO_L2_OVF_CH2_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_S  17
/** AXI_DMA_OUT_REMAIN_UNDER_1B_CH2 : RO; bitpos: [23]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH2    (BIT(23))
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_1B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_1B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_1B_CH2_S  23
/** AXI_DMA_OUT_REMAIN_UNDER_2B_CH2 : RO; bitpos: [24]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH2    (BIT(24))
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_2B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_2B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_2B_CH2_S  24
/** AXI_DMA_OUT_REMAIN_UNDER_3B_CH2 : RO; bitpos: [25]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH2    (BIT(25))
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_3B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_3B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_3B_CH2_S  25
/** AXI_DMA_OUT_REMAIN_UNDER_4B_CH2 : RO; bitpos: [26]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH2    (BIT(26))
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_4B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_4B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_4B_CH2_S  26
/** AXI_DMA_OUT_REMAIN_UNDER_5B_CH2 : RO; bitpos: [27]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH2    (BIT(27))
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_5B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_5B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_5B_CH2_S  27
/** AXI_DMA_OUT_REMAIN_UNDER_6B_CH2 : RO; bitpos: [28]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH2    (BIT(28))
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_6B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_6B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_6B_CH2_S  28
/** AXI_DMA_OUT_REMAIN_UNDER_7B_CH2 : RO; bitpos: [29]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH2    (BIT(29))
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_7B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_7B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_7B_CH2_S  29
/** AXI_DMA_OUT_REMAIN_UNDER_8B_CH2 : RO; bitpos: [30]; default: 1;
 *  reserved
 */
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH2    (BIT(30))
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH2_M  (AXI_DMA_OUT_REMAIN_UNDER_8B_CH2_V << AXI_DMA_OUT_REMAIN_UNDER_8B_CH2_S)
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH2_V  0x00000001U
#define AXI_DMA_OUT_REMAIN_UNDER_8B_CH2_S  30

/** AXI_DMA_OUT_PUSH_CH2_REG register
 *  Push control register of Tx channel2
 */
#define AXI_DMA_OUT_PUSH_CH2_REG (DR_REG_AXI_DMA_BASE + 0x224)
/** AXI_DMA_OUTFIFO_WDATA_CH2 : R/W; bitpos: [8:0]; default: 0;
 *  This register stores the data that need to be pushed into AXI_DMA FIFO.
 */
#define AXI_DMA_OUTFIFO_WDATA_CH2    0x000001FFU
#define AXI_DMA_OUTFIFO_WDATA_CH2_M  (AXI_DMA_OUTFIFO_WDATA_CH2_V << AXI_DMA_OUTFIFO_WDATA_CH2_S)
#define AXI_DMA_OUTFIFO_WDATA_CH2_V  0x000001FFU
#define AXI_DMA_OUTFIFO_WDATA_CH2_S  0
/** AXI_DMA_OUTFIFO_PUSH_CH2 : WT; bitpos: [9]; default: 0;
 *  Set this bit to push data into AXI_DMA FIFO.
 */
#define AXI_DMA_OUTFIFO_PUSH_CH2    (BIT(9))
#define AXI_DMA_OUTFIFO_PUSH_CH2_M  (AXI_DMA_OUTFIFO_PUSH_CH2_V << AXI_DMA_OUTFIFO_PUSH_CH2_S)
#define AXI_DMA_OUTFIFO_PUSH_CH2_V  0x00000001U
#define AXI_DMA_OUTFIFO_PUSH_CH2_S  9

/** AXI_DMA_OUT_LINK1_CH2_REG register
 *  Link descriptor configure and control register of Tx channel2
 */
#define AXI_DMA_OUT_LINK1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x228)
/** AXI_DMA_OUTLINK_STOP_CH2 : WT; bitpos: [0]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define AXI_DMA_OUTLINK_STOP_CH2    (BIT(0))
#define AXI_DMA_OUTLINK_STOP_CH2_M  (AXI_DMA_OUTLINK_STOP_CH2_V << AXI_DMA_OUTLINK_STOP_CH2_S)
#define AXI_DMA_OUTLINK_STOP_CH2_V  0x00000001U
#define AXI_DMA_OUTLINK_STOP_CH2_S  0
/** AXI_DMA_OUTLINK_START_CH2 : WT; bitpos: [1]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define AXI_DMA_OUTLINK_START_CH2    (BIT(1))
#define AXI_DMA_OUTLINK_START_CH2_M  (AXI_DMA_OUTLINK_START_CH2_V << AXI_DMA_OUTLINK_START_CH2_S)
#define AXI_DMA_OUTLINK_START_CH2_V  0x00000001U
#define AXI_DMA_OUTLINK_START_CH2_S  1
/** AXI_DMA_OUTLINK_RESTART_CH2 : WT; bitpos: [2]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define AXI_DMA_OUTLINK_RESTART_CH2    (BIT(2))
#define AXI_DMA_OUTLINK_RESTART_CH2_M  (AXI_DMA_OUTLINK_RESTART_CH2_V << AXI_DMA_OUTLINK_RESTART_CH2_S)
#define AXI_DMA_OUTLINK_RESTART_CH2_V  0x00000001U
#define AXI_DMA_OUTLINK_RESTART_CH2_S  2
/** AXI_DMA_OUTLINK_PARK_CH2 : RO; bitpos: [3]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define AXI_DMA_OUTLINK_PARK_CH2    (BIT(3))
#define AXI_DMA_OUTLINK_PARK_CH2_M  (AXI_DMA_OUTLINK_PARK_CH2_V << AXI_DMA_OUTLINK_PARK_CH2_S)
#define AXI_DMA_OUTLINK_PARK_CH2_V  0x00000001U
#define AXI_DMA_OUTLINK_PARK_CH2_S  3

/** AXI_DMA_OUT_LINK2_CH2_REG register
 *  Link descriptor configure and control register of Tx channel2
 */
#define AXI_DMA_OUT_LINK2_CH2_REG (DR_REG_AXI_DMA_BASE + 0x22c)
/** AXI_DMA_OUTLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the 32 least significant bits of the first outlink
 *  descriptor's address.
 */
#define AXI_DMA_OUTLINK_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH2_M  (AXI_DMA_OUTLINK_ADDR_CH2_V << AXI_DMA_OUTLINK_ADDR_CH2_S)
#define AXI_DMA_OUTLINK_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH2_S  0

/** AXI_DMA_OUT_STATE_CH2_REG register
 *  Transmit status of Tx channel2
 */
#define AXI_DMA_OUT_STATE_CH2_REG (DR_REG_AXI_DMA_BASE + 0x230)
/** AXI_DMA_OUTLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH2_M  (AXI_DMA_OUTLINK_DSCR_ADDR_CH2_V << AXI_DMA_OUTLINK_DSCR_ADDR_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH2_S  0
/** AXI_DMA_OUT_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_DSCR_STATE_CH2    0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH2_M  (AXI_DMA_OUT_DSCR_STATE_CH2_V << AXI_DMA_OUT_DSCR_STATE_CH2_S)
#define AXI_DMA_OUT_DSCR_STATE_CH2_V  0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH2_S  18
/** AXI_DMA_OUT_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_STATE_CH2    0x00000007U
#define AXI_DMA_OUT_STATE_CH2_M  (AXI_DMA_OUT_STATE_CH2_V << AXI_DMA_OUT_STATE_CH2_S)
#define AXI_DMA_OUT_STATE_CH2_V  0x00000007U
#define AXI_DMA_OUT_STATE_CH2_S  20

/** AXI_DMA_OUT_EOF_DES_ADDR_CH2_REG register
 *  Outlink descriptor address when EOF occurs of Tx channel2
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x234)
/** AXI_DMA_OUT_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH2_M  (AXI_DMA_OUT_EOF_DES_ADDR_CH2_V << AXI_DMA_OUT_EOF_DES_ADDR_CH2_S)
#define AXI_DMA_OUT_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH2_S  0

/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_REG register
 *  The last outlink descriptor address when EOF occurs of Tx channel2
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x238)
/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor before the last outlink
 *  descriptor.
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_M  (AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_V << AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_S)
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH2_S  0

