espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_OUT_DSCR_CH2_REG register
 *  Current outlink descriptor address of Tx channel2
 */
#define AXI_DMA_OUT_DSCR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x23c)
/** AXI_DMA_OUTLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define AXI_DMA_OUTLINK_DSCR_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH2_M  (AXI_DMA_OUTLINK_DSCR_CH2_V << AXI_DMA_OUTLINK_DSCR_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH2_S  0

/** AXI_DMA_OUT_DSCR_BF0_CH2_REG register
 *  The last outlink descriptor address of Tx channel2
 */
#define AXI_DMA_OUT_DSCR_BF0_CH2_REG (DR_REG_AXI_DMA_BASE + 0x240)
/** AXI_DMA_OUTLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2_M  (AXI_DMA_OUTLINK_DSCR_BF0_CH2_V << AXI_DMA_OUTLINK_DSCR_BF0_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2_S  0

/** AXI_DMA_OUT_DSCR_BF1_CH2_REG register
 *  The second-to-last outlink descriptor address of Tx channel2
 */
#define AXI_DMA_OUT_DSCR_BF1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x244)
/** AXI_DMA_OUTLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor x-2.
 */
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2_M  (AXI_DMA_OUTLINK_DSCR_BF1_CH2_V << AXI_DMA_OUTLINK_DSCR_BF1_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2_S  0

/** AXI_DMA_OUT_PRI_CH2_REG register
 *  Priority register of Tx channel2.
 */
#define AXI_DMA_OUT_PRI_CH2_REG (DR_REG_AXI_DMA_BASE + 0x248)
/** AXI_DMA_TX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Tx channel0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_TX_PRI_CH2    0x0000000FU
#define AXI_DMA_TX_PRI_CH2_M  (AXI_DMA_TX_PRI_CH2_V << AXI_DMA_TX_PRI_CH2_S)
#define AXI_DMA_TX_PRI_CH2_V  0x0000000FU
#define AXI_DMA_TX_PRI_CH2_S  0
/** AXI_DMA_TX_CH_ARB_WEIGH_CH2 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Tx channel0
 */
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2    0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2_M  (AXI_DMA_TX_CH_ARB_WEIGH_CH2_V << AXI_DMA_TX_CH_ARB_WEIGH_CH2_S)
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2_V  0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2_S  4
/** AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2    (BIT(8))
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_M  (AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_V << AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_S)
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_V  0x00000001U
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_S  8

/** AXI_DMA_OUT_PERI_SEL_CH2_REG register
 *  Peripheral selection of Tx channel2
 */
#define AXI_DMA_OUT_PERI_SEL_CH2_REG (DR_REG_AXI_DMA_BASE + 0x24c)
/** AXI_DMA_PERI_OUT_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_OUT_SEL_CH2    0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH2_M  (AXI_DMA_PERI_OUT_SEL_CH2_V << AXI_DMA_PERI_OUT_SEL_CH2_S)
#define AXI_DMA_PERI_OUT_SEL_CH2_V  0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH2_S  0

/** AXI_DMA_OUT_CRC_INIT_DATA_CH2_REG register
 *  This register is used to config ch2 crc initial data(max 32 bit)
 */
#define AXI_DMA_OUT_CRC_INIT_DATA_CH2_REG (DR_REG_AXI_DMA_BASE + 0x250)
/** AXI_DMA_OUT_CRC_INIT_DATA_CH2 : R/W; bitpos: [31:0]; default: 4294967295;
 *  This register is used to config ch0 of tx crc initial value
 */
#define AXI_DMA_OUT_CRC_INIT_DATA_CH2    0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_INIT_DATA_CH2_M  (AXI_DMA_OUT_CRC_INIT_DATA_CH2_V << AXI_DMA_OUT_CRC_INIT_DATA_CH2_S)
#define AXI_DMA_OUT_CRC_INIT_DATA_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_INIT_DATA_CH2_S  0

/** AXI_DMA_TX_CRC_WIDTH_CH2_REG register
 *  This register is used to confiig tx ch2 crc result width,2'b00 mean crc_width
 *  <=8bit,2'b01 8<crc_width<=16 ,2'b10 mean 16<crc_width  <=24,2'b11 mean
 *  24<crc_width<=32
 */
#define AXI_DMA_TX_CRC_WIDTH_CH2_REG (DR_REG_AXI_DMA_BASE + 0x254)
/** AXI_DMA_TX_CRC_WIDTH_CH2 : R/W; bitpos: [1:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_WIDTH_CH2    0x00000003U
#define AXI_DMA_TX_CRC_WIDTH_CH2_M  (AXI_DMA_TX_CRC_WIDTH_CH2_V << AXI_DMA_TX_CRC_WIDTH_CH2_S)
#define AXI_DMA_TX_CRC_WIDTH_CH2_V  0x00000003U
#define AXI_DMA_TX_CRC_WIDTH_CH2_S  0
/** AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2 : R/W; bitpos: [2]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2    (BIT(2))
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2_M  (AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2_V << AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2_S)
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2_V  0x00000001U
#define AXI_DMA_TX_CRC_LAUTCH_FLGA_CH2_S  2

/** AXI_DMA_OUT_CRC_CLEAR_CH2_REG register
 *  This register is used to clear ch2 crc result
 */
#define AXI_DMA_OUT_CRC_CLEAR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x258)
/** AXI_DMA_OUT_CRC_CLEAR_CH2 : R/W; bitpos: [0]; default: 0;
 *  This register is used to clear ch0 of tx crc result
 */
#define AXI_DMA_OUT_CRC_CLEAR_CH2    (BIT(0))
#define AXI_DMA_OUT_CRC_CLEAR_CH2_M  (AXI_DMA_OUT_CRC_CLEAR_CH2_V << AXI_DMA_OUT_CRC_CLEAR_CH2_S)
#define AXI_DMA_OUT_CRC_CLEAR_CH2_V  0x00000001U
#define AXI_DMA_OUT_CRC_CLEAR_CH2_S  0

/** AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_REG register
 *  This register is used to store ch2 crc result
 */
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_REG (DR_REG_AXI_DMA_BASE + 0x25c)
/** AXI_DMA_OUT_CRC_FINAL_RESULT_CH2 : RO; bitpos: [31:0]; default: 0;
 *  This register is used to store result ch0 of tx
 */
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH2    0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_M  (AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_V << AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_S)
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUT_CRC_FINAL_RESULT_CH2_S  0

/** AXI_DMA_TX_CRC_EN_WR_DATA_CH2_REG register
 *  This resister is used to config ch2 crc en for every bit
 */
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH2_REG (DR_REG_AXI_DMA_BASE + 0x260)
/** AXI_DMA_TX_CRC_EN_WR_DATA_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  This register is used to enable tx ch0 crc 32bit on/off
 */
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH2    0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH2_M  (AXI_DMA_TX_CRC_EN_WR_DATA_CH2_V << AXI_DMA_TX_CRC_EN_WR_DATA_CH2_S)
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH2_V  0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_WR_DATA_CH2_S  0

/** AXI_DMA_TX_CRC_EN_ADDR_CH2_REG register
 *  This register is used to config ch2 crc en addr
 */
#define AXI_DMA_TX_CRC_EN_ADDR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x264)
/** AXI_DMA_TX_CRC_EN_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_EN_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_ADDR_CH2_M  (AXI_DMA_TX_CRC_EN_ADDR_CH2_V << AXI_DMA_TX_CRC_EN_ADDR_CH2_S)
#define AXI_DMA_TX_CRC_EN_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_TX_CRC_EN_ADDR_CH2_S  0

