espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_REG register
 *  This register is used to config crc data_8bit en
 */
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_REG (DR_REG_AXI_DMA_BASE + 0x268)
/** AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2 : R/W; bitpos: [15:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2    0x0000FFFFU
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_M  (AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_V << AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_S)
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_V  0x0000FFFFU
#define AXI_DMA_TX_CRC_DATA_EN_WR_DATA_CH2_S  0

/** AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_REG register
 *  This register is used to config addr of crc data_8bit en
 */
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x26c)
/** AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2    0xFFFFFFFFU
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_M  (AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_V << AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_S)
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_TX_CRC_DATA_EN_ADDR_CH2_S  0

/** AXI_DMA_ARB_TIMEOUT_REG register
 *  This retister is used to config arbiter time slice
 */
#define AXI_DMA_ARB_TIMEOUT_REG (DR_REG_AXI_DMA_BASE + 0x270)
/** AXI_DMA_ARB_TIMEOUT_TX : R/W; bitpos: [15:0]; default: 0;
 *  This register is used to config tx arbiter time out value
 */
#define AXI_DMA_ARB_TIMEOUT_TX    0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_TX_M  (AXI_DMA_ARB_TIMEOUT_TX_V << AXI_DMA_ARB_TIMEOUT_TX_S)
#define AXI_DMA_ARB_TIMEOUT_TX_V  0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_TX_S  0
/** AXI_DMA_ARB_TIMEOUT_RX : R/W; bitpos: [31:16]; default: 0;
 *  This register is used to config rx arbiter time out value
 */
#define AXI_DMA_ARB_TIMEOUT_RX    0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_RX_M  (AXI_DMA_ARB_TIMEOUT_RX_V << AXI_DMA_ARB_TIMEOUT_RX_S)
#define AXI_DMA_ARB_TIMEOUT_RX_V  0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_RX_S  16

/** AXI_DMA_WEIGHT_EN_REG register
 *  This register is used to config arbiter weight function to on or off
 */
#define AXI_DMA_WEIGHT_EN_REG (DR_REG_AXI_DMA_BASE + 0x274)
/** AXI_DMA_WEIGHT_EN_TX : R/W; bitpos: [0]; default: 0;
 *  This register is used to config tx arbiter weight function  off/on
 */
#define AXI_DMA_WEIGHT_EN_TX    (BIT(0))
#define AXI_DMA_WEIGHT_EN_TX_M  (AXI_DMA_WEIGHT_EN_TX_V << AXI_DMA_WEIGHT_EN_TX_S)
#define AXI_DMA_WEIGHT_EN_TX_V  0x00000001U
#define AXI_DMA_WEIGHT_EN_TX_S  0
/** AXI_DMA_WEIGHT_EN_RX : R/W; bitpos: [1]; default: 0;
 *  This register is used to config rx arbiter weight function  off/on
 */
#define AXI_DMA_WEIGHT_EN_RX    (BIT(1))
#define AXI_DMA_WEIGHT_EN_RX_M  (AXI_DMA_WEIGHT_EN_RX_V << AXI_DMA_WEIGHT_EN_RX_S)
#define AXI_DMA_WEIGHT_EN_RX_V  0x00000001U
#define AXI_DMA_WEIGHT_EN_RX_S  1

/** AXI_DMA_IN_MEM_CONF_REG register
 *  Mem power configure register of Rx channel
 */
#define AXI_DMA_IN_MEM_CONF_REG (DR_REG_AXI_DMA_BASE + 0x278)
/** AXI_DMA_IN_MEM_CLK_FORCE_EN : R/W; bitpos: [0]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
 *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
 */
#define AXI_DMA_IN_MEM_CLK_FORCE_EN    (BIT(0))
#define AXI_DMA_IN_MEM_CLK_FORCE_EN_M  (AXI_DMA_IN_MEM_CLK_FORCE_EN_V << AXI_DMA_IN_MEM_CLK_FORCE_EN_S)
#define AXI_DMA_IN_MEM_CLK_FORCE_EN_V  0x00000001U
#define AXI_DMA_IN_MEM_CLK_FORCE_EN_S  0
/** AXI_DMA_IN_MEM_FORCE_PU : R/W; bitpos: [1]; default: 0;
 *  Force power up ram
 */
#define AXI_DMA_IN_MEM_FORCE_PU    (BIT(1))
#define AXI_DMA_IN_MEM_FORCE_PU_M  (AXI_DMA_IN_MEM_FORCE_PU_V << AXI_DMA_IN_MEM_FORCE_PU_S)
#define AXI_DMA_IN_MEM_FORCE_PU_V  0x00000001U
#define AXI_DMA_IN_MEM_FORCE_PU_S  1
/** AXI_DMA_IN_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Force power down ram
 */
#define AXI_DMA_IN_MEM_FORCE_PD    (BIT(2))
#define AXI_DMA_IN_MEM_FORCE_PD_M  (AXI_DMA_IN_MEM_FORCE_PD_V << AXI_DMA_IN_MEM_FORCE_PD_S)
#define AXI_DMA_IN_MEM_FORCE_PD_V  0x00000001U
#define AXI_DMA_IN_MEM_FORCE_PD_S  2
/** AXI_DMA_OUT_MEM_CLK_FORCE_EN : R/W; bitpos: [3]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
 *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
 */
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN    (BIT(3))
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN_M  (AXI_DMA_OUT_MEM_CLK_FORCE_EN_V << AXI_DMA_OUT_MEM_CLK_FORCE_EN_S)
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN_V  0x00000001U
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN_S  3
/** AXI_DMA_OUT_MEM_FORCE_PU : R/W; bitpos: [4]; default: 0;
 *  Force power up ram
 */
#define AXI_DMA_OUT_MEM_FORCE_PU    (BIT(4))
#define AXI_DMA_OUT_MEM_FORCE_PU_M  (AXI_DMA_OUT_MEM_FORCE_PU_V << AXI_DMA_OUT_MEM_FORCE_PU_S)
#define AXI_DMA_OUT_MEM_FORCE_PU_V  0x00000001U
#define AXI_DMA_OUT_MEM_FORCE_PU_S  4
/** AXI_DMA_OUT_MEM_FORCE_PD : R/W; bitpos: [5]; default: 0;
 *  Force power down ram
 */
#define AXI_DMA_OUT_MEM_FORCE_PD    (BIT(5))
#define AXI_DMA_OUT_MEM_FORCE_PD_M  (AXI_DMA_OUT_MEM_FORCE_PD_V << AXI_DMA_OUT_MEM_FORCE_PD_S)
#define AXI_DMA_OUT_MEM_FORCE_PD_V  0x00000001U
#define AXI_DMA_OUT_MEM_FORCE_PD_S  5

/** AXI_DMA_INTR_MEM_START_ADDR_REG register
 *  The start address of accessible address space.
 */
#define AXI_DMA_INTR_MEM_START_ADDR_REG (DR_REG_AXI_DMA_BASE + 0x27c)
/** AXI_DMA_ACCESS_INTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define AXI_DMA_ACCESS_INTR_MEM_START_ADDR    0xFFFFFFFFU
#define AXI_DMA_ACCESS_INTR_MEM_START_ADDR_M  (AXI_DMA_ACCESS_INTR_MEM_START_ADDR_V << AXI_DMA_ACCESS_INTR_MEM_START_ADDR_S)
#define AXI_DMA_ACCESS_INTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define AXI_DMA_ACCESS_INTR_MEM_START_ADDR_S  0

/** AXI_DMA_INTR_MEM_END_ADDR_REG register
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define AXI_DMA_INTR_MEM_END_ADDR_REG (DR_REG_AXI_DMA_BASE + 0x280)
/** AXI_DMA_ACCESS_INTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define AXI_DMA_ACCESS_INTR_MEM_END_ADDR    0xFFFFFFFFU
#define AXI_DMA_ACCESS_INTR_MEM_END_ADDR_M  (AXI_DMA_ACCESS_INTR_MEM_END_ADDR_V << AXI_DMA_ACCESS_INTR_MEM_END_ADDR_S)
#define AXI_DMA_ACCESS_INTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define AXI_DMA_ACCESS_INTR_MEM_END_ADDR_S  0

