espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/axi_dma_reg.h
/** AXI_DMA_EXTR_MEM_START_ADDR_REG register
 *  The start address of accessible address space.
 */
#define AXI_DMA_EXTR_MEM_START_ADDR_REG (DR_REG_AXI_DMA_BASE + 0x284)
/** AXI_DMA_ACCESS_EXTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 806354944;
 *  The start address of accessible address space.
 */
#define AXI_DMA_ACCESS_EXTR_MEM_START_ADDR    0xFFFFFFFFU
#define AXI_DMA_ACCESS_EXTR_MEM_START_ADDR_M  (AXI_DMA_ACCESS_EXTR_MEM_START_ADDR_V << AXI_DMA_ACCESS_EXTR_MEM_START_ADDR_S)
#define AXI_DMA_ACCESS_EXTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define AXI_DMA_ACCESS_EXTR_MEM_START_ADDR_S  0

/** AXI_DMA_EXTR_MEM_END_ADDR_REG register
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define AXI_DMA_EXTR_MEM_END_ADDR_REG (DR_REG_AXI_DMA_BASE + 0x288)
/** AXI_DMA_ACCESS_EXTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 2415919103;
 *  The end address of accessible address space. The access address beyond this range
 *  would lead to descriptor error.
 */
#define AXI_DMA_ACCESS_EXTR_MEM_END_ADDR    0xFFFFFFFFU
#define AXI_DMA_ACCESS_EXTR_MEM_END_ADDR_M  (AXI_DMA_ACCESS_EXTR_MEM_END_ADDR_V << AXI_DMA_ACCESS_EXTR_MEM_END_ADDR_S)
#define AXI_DMA_ACCESS_EXTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define AXI_DMA_ACCESS_EXTR_MEM_END_ADDR_S  0

/** AXI_DMA_IN_RESET_AVAIL_CH0_REG register
 *  The rx channel 0 reset valid_flag register.
 */
#define AXI_DMA_IN_RESET_AVAIL_CH0_REG (DR_REG_AXI_DMA_BASE + 0x28c)
/** AXI_DMA_IN_RESET_AVAIL_CH0 : RO; bitpos: [0]; default: 1;
 *  rx chan0 reset valid reg.
 */
#define AXI_DMA_IN_RESET_AVAIL_CH0    (BIT(0))
#define AXI_DMA_IN_RESET_AVAIL_CH0_M  (AXI_DMA_IN_RESET_AVAIL_CH0_V << AXI_DMA_IN_RESET_AVAIL_CH0_S)
#define AXI_DMA_IN_RESET_AVAIL_CH0_V  0x00000001U
#define AXI_DMA_IN_RESET_AVAIL_CH0_S  0

/** AXI_DMA_IN_RESET_AVAIL_CH1_REG register
 *  The rx channel 1 reset valid_flag register.
 */
#define AXI_DMA_IN_RESET_AVAIL_CH1_REG (DR_REG_AXI_DMA_BASE + 0x290)
/** AXI_DMA_IN_RESET_AVAIL_CH1 : RO; bitpos: [0]; default: 1;
 *  rx chan0 reset valid reg.
 */
#define AXI_DMA_IN_RESET_AVAIL_CH1    (BIT(0))
#define AXI_DMA_IN_RESET_AVAIL_CH1_M  (AXI_DMA_IN_RESET_AVAIL_CH1_V << AXI_DMA_IN_RESET_AVAIL_CH1_S)
#define AXI_DMA_IN_RESET_AVAIL_CH1_V  0x00000001U
#define AXI_DMA_IN_RESET_AVAIL_CH1_S  0

/** AXI_DMA_IN_RESET_AVAIL_CH2_REG register
 *  The rx channel 2 reset valid_flag register.
 */
#define AXI_DMA_IN_RESET_AVAIL_CH2_REG (DR_REG_AXI_DMA_BASE + 0x294)
/** AXI_DMA_IN_RESET_AVAIL_CH2 : RO; bitpos: [0]; default: 1;
 *  rx chan0 reset valid reg.
 */
#define AXI_DMA_IN_RESET_AVAIL_CH2    (BIT(0))
#define AXI_DMA_IN_RESET_AVAIL_CH2_M  (AXI_DMA_IN_RESET_AVAIL_CH2_V << AXI_DMA_IN_RESET_AVAIL_CH2_S)
#define AXI_DMA_IN_RESET_AVAIL_CH2_V  0x00000001U
#define AXI_DMA_IN_RESET_AVAIL_CH2_S  0

/** AXI_DMA_OUT_RESET_AVAIL_CH0_REG register
 *  The tx channel 0 reset valid_flag register.
 */
#define AXI_DMA_OUT_RESET_AVAIL_CH0_REG (DR_REG_AXI_DMA_BASE + 0x298)
/** AXI_DMA_OUT_RESET_AVAIL_CH0 : RO; bitpos: [0]; default: 1;
 *  tx chan0 reset valid reg.
 */
#define AXI_DMA_OUT_RESET_AVAIL_CH0    (BIT(0))
#define AXI_DMA_OUT_RESET_AVAIL_CH0_M  (AXI_DMA_OUT_RESET_AVAIL_CH0_V << AXI_DMA_OUT_RESET_AVAIL_CH0_S)
#define AXI_DMA_OUT_RESET_AVAIL_CH0_V  0x00000001U
#define AXI_DMA_OUT_RESET_AVAIL_CH0_S  0

/** AXI_DMA_OUT_RESET_AVAIL_CH1_REG register
 *  The tx channel 1 reset valid_flag register.
 */
#define AXI_DMA_OUT_RESET_AVAIL_CH1_REG (DR_REG_AXI_DMA_BASE + 0x29c)
/** AXI_DMA_OUT_RESET_AVAIL_CH1 : RO; bitpos: [0]; default: 1;
 *  tx chan0 reset valid reg.
 */
#define AXI_DMA_OUT_RESET_AVAIL_CH1    (BIT(0))
#define AXI_DMA_OUT_RESET_AVAIL_CH1_M  (AXI_DMA_OUT_RESET_AVAIL_CH1_V << AXI_DMA_OUT_RESET_AVAIL_CH1_S)
#define AXI_DMA_OUT_RESET_AVAIL_CH1_V  0x00000001U
#define AXI_DMA_OUT_RESET_AVAIL_CH1_S  0

/** AXI_DMA_OUT_RESET_AVAIL_CH2_REG register
 *  The tx channel 2 reset valid_flag register.
 */
#define AXI_DMA_OUT_RESET_AVAIL_CH2_REG (DR_REG_AXI_DMA_BASE + 0x2a0)
/** AXI_DMA_OUT_RESET_AVAIL_CH2 : RO; bitpos: [0]; default: 1;
 *  tx chan0 reset valid reg.
 */
#define AXI_DMA_OUT_RESET_AVAIL_CH2    (BIT(0))
#define AXI_DMA_OUT_RESET_AVAIL_CH2_M  (AXI_DMA_OUT_RESET_AVAIL_CH2_V << AXI_DMA_OUT_RESET_AVAIL_CH2_S)
#define AXI_DMA_OUT_RESET_AVAIL_CH2_V  0x00000001U
#define AXI_DMA_OUT_RESET_AVAIL_CH2_S  0

/** AXI_DMA_MISC_CONF_REG register
 *  MISC register
 */
#define AXI_DMA_MISC_CONF_REG (DR_REG_AXI_DMA_BASE + 0x2a8)
/** AXI_DMA_AXIM_RST_WR_INTER : R/W; bitpos: [0]; default: 0;
 *  Set this bit then clear this bit to reset the internal axi_wr FSM.
 */
#define AXI_DMA_AXIM_RST_WR_INTER    (BIT(0))
#define AXI_DMA_AXIM_RST_WR_INTER_M  (AXI_DMA_AXIM_RST_WR_INTER_V << AXI_DMA_AXIM_RST_WR_INTER_S)
#define AXI_DMA_AXIM_RST_WR_INTER_V  0x00000001U
#define AXI_DMA_AXIM_RST_WR_INTER_S  0
/** AXI_DMA_AXIM_RST_RD_INTER : R/W; bitpos: [1]; default: 0;
 *  Set this bit then clear this bit to reset the internal axi_rd FSM.
 */
#define AXI_DMA_AXIM_RST_RD_INTER    (BIT(1))
#define AXI_DMA_AXIM_RST_RD_INTER_M  (AXI_DMA_AXIM_RST_RD_INTER_V << AXI_DMA_AXIM_RST_RD_INTER_S)
#define AXI_DMA_AXIM_RST_RD_INTER_V  0x00000001U
#define AXI_DMA_AXIM_RST_RD_INTER_S  1
/** AXI_DMA_ARB_PRI_DIS : R/W; bitpos: [3]; default: 0;
 *  Set this bit to disable priority arbitration function.
 */
#define AXI_DMA_ARB_PRI_DIS    (BIT(3))
#define AXI_DMA_ARB_PRI_DIS_M  (AXI_DMA_ARB_PRI_DIS_V << AXI_DMA_ARB_PRI_DIS_S)
#define AXI_DMA_ARB_PRI_DIS_V  0x00000001U
#define AXI_DMA_ARB_PRI_DIS_S  3
/** AXI_DMA_CLK_EN : R/W; bitpos: [4]; default: 0;
 *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
 *  registers.
 */
#define AXI_DMA_CLK_EN    (BIT(4))
#define AXI_DMA_CLK_EN_M  (AXI_DMA_CLK_EN_V << AXI_DMA_CLK_EN_S)
#define AXI_DMA_CLK_EN_V  0x00000001U
#define AXI_DMA_CLK_EN_S  4

/** AXI_DMA_RDN_RESULT_REG register
 *  reserved
 */
#define AXI_DMA_RDN_RESULT_REG (DR_REG_AXI_DMA_BASE + 0x2ac)
/** AXI_DMA_RDN_ENA : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AXI_DMA_RDN_ENA    (BIT(0))
#define AXI_DMA_RDN_ENA_M  (AXI_DMA_RDN_ENA_V << AXI_DMA_RDN_ENA_S)
#define AXI_DMA_RDN_ENA_V  0x00000001U
#define AXI_DMA_RDN_ENA_S  0
/** AXI_DMA_RDN_RESULT : RO; bitpos: [1]; default: 0;
 *  reserved
 */
#define AXI_DMA_RDN_RESULT    (BIT(1))
#define AXI_DMA_RDN_RESULT_M  (AXI_DMA_RDN_RESULT_V << AXI_DMA_RDN_RESULT_S)
#define AXI_DMA_RDN_RESULT_V  0x00000001U
#define AXI_DMA_RDN_RESULT_S  1

/** AXI_DMA_RDN_ECO_HIGH_REG register
 *  reserved
 */
#define AXI_DMA_RDN_ECO_HIGH_REG (DR_REG_AXI_DMA_BASE + 0x2b0)
/** AXI_DMA_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  The start address of accessible address space.
 */
#define AXI_DMA_RDN_ECO_HIGH    0xFFFFFFFFU
#define AXI_DMA_RDN_ECO_HIGH_M  (AXI_DMA_RDN_ECO_HIGH_V << AXI_DMA_RDN_ECO_HIGH_S)
#define AXI_DMA_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define AXI_DMA_RDN_ECO_HIGH_S  0

/** AXI_DMA_RDN_ECO_LOW_REG register
 *  reserved
 */
#define AXI_DMA_RDN_ECO_LOW_REG (DR_REG_AXI_DMA_BASE + 0x2b4)
/** AXI_DMA_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  The start address of accessible address space.
 */
#define AXI_DMA_RDN_ECO_LOW    0xFFFFFFFFU
#define AXI_DMA_RDN_ECO_LOW_M  (AXI_DMA_RDN_ECO_LOW_V << AXI_DMA_RDN_ECO_LOW_S)
#define AXI_DMA_RDN_ECO_LOW_V  0xFFFFFFFFU
#define AXI_DMA_RDN_ECO_LOW_S  0

